{
  "PICKUP_ESENDEO": "Parcel picked up by Esendeo.",
  "STOCK_IN_ESENDEO": "Parcel arrived at the Esendeo depot.",
  "STOCK_OUT_ESENDEO": "Parcel picked up by the transporter.",
  "RST_BRT": "Your package is sent to a collection point. You will receive a notification as soon as your package is available.",
  "ND1": "Your package has been returned to the sender at his request.",
  "DOU_IDD": "Your package is in the process of customs clearance. It is retained by the postal services for an identification of the content. Our services may need to contact you.",
  "ENE_AVA": "You have chosen the letterbox delivery service for your package. Unfortunately, we were unable to perform the service because your package was damaged or opened. A notification has been sent to you and tells you what to do.",
  "MD2": "Your package will be delivered in the second part of the day.",
  "ENE_DOC": "You have chosen the letterbox delivery service for your package. Unfortunately the service could not be carried out because the number indicated on the label did not correspond to that of the package to be recovered. A notification has been sent to you and tells you what to do.",
  "RST_PRO": "The content of your package is prohibited, it cannot be delivered to you.",
  "ET3": "Your package has arrived in the recipient's country.",
  "CIT_DOC": "After treatment by our services, your package is sent to the recipient. We ask you to accept our apologies.",
  "DR1": "Your package will be collected from your mailbox under the conditions provided.",
  "DOU_RES": "Your package is in the process of customs clearance. It is withheld by the postal services due to a missing license. Our services may need to contact you.",
  "RE1": "Due to your refusal for non-ordering, your package is returned to the sender.",
  "PB1": "The delivery of your package has been stopped and your package will not be delivered to you. We invite you to contact your shipper or our customer service for any additional information.",
  "DOU_TAX": "Your package is customs cleared and it will be delivered against payment of customs duties and taxes.",
  "ENE_DAF": "You have chosen the letterbox delivery service for your package. Unfortunately the service could not be performed because your mailbox was not found or it was inaccessible. A notification has been sent to you and tells you what to do.",
  "ENE_NCF": "You have chosen the letterbox delivery service for your package. Unfortunately the service could not be performed because your package did not include a label. A notification has been sent to you and tells you what to do.",
  "REN_AIN": "The delivery address is incomplete and we cannot deliver your package to you. We are looking for additional information allowing us to ensure the proper delivery of your package. You can contact our customer service to provide the necessary additional information.",
  "PB2": "After treatment by our services, your package is sent to the recipient. We ask you to accept our apologies.",
  "EP1": "Your package could not be delivered today and will be delivered as soon as possible. The choice of a redelivery date or a pick-up point is possible until midnight on our website.",
  "ET1": "Your package is in transit on our logistics platforms to be delivered to you as quickly as possible.",
  "CHG_CFM": "Your package has arrived in France.",
  "DOU_AGV": "Your package is in the process of customs clearance.",
  "DI2": "Your package is delivered to its sender following a return.",
  "DOU_IIR": "Your package is held by the postal services because customs clearance information is required. Our services may need to contact you.",
  "PCH_CHM": "Your package is in transit to its country of origin.",
  "DO1": "Your shipment is in the process of customs clearance.",
  "DOU_DDM": "Your package is in the process of customs clearance. It was detained by the postal services due to a missing CN23 customs declaration. Our services may need to contact you.",
  "ENE_MQT": "You have chosen the letterbox delivery service for your package. Unfortunately the service could not be performed because your package was not in your mailbox. A notification has been sent to you and tells you what to do.",
  "MLV_ARX": "Your package is available at a different pick-up point from the one initially planned. It will wait for you for a period of 10 working days. Do not delay in picking it up! It will be given to you on presentation of an identity document.",
  "AG1": "Your package is waiting for you at your collection point. Do not delay in picking it up within the time limit that has been indicated to you!",
  "PC2": "Your package has been deposited by the sender at our postal partner in his country of origin.",
  "50": "50",
  "75": "75",
  "125": "125",
  "150": "150",
  "155": "155",
  "250": "250",
  "CLEARED": "Customs clearenced",
  "DI1": "Your parcel has been delivered to your letter box.",
  "DO3": "Your package is in the process of customs clearance and it is held by the postal services due to a missing invoice. Our services may need to contact you.",
  "ET2": "Your package is ready from its shipping territory. It will be handed over to the carrier for its delivery",
  "PC1": "Your package was dropped off at a post office too late to leave today. He will leave tomorrow (or the next working day in case of Sunday or public holiday).",
  "AAR_CFM": "Your parcel has arrived at its delivery location",
  "AAR_DVY": "Your parcel has arrived in error at a site. It is currently being rerouted to its delivery location",
  "CHG_RCA": "Your parcel has been repaired - delivery on going",
  "COM_CFM": "La Poste is handling your parcel. It is currently being routed.",
  "DCH_RCA": "Your parcel has been returned to the sender following an incident.",
  "DCH_RMA": "The packaging of your parcel has been strengthened to ensure it can be delivered. It is being routed.",
  "EXP_CFM": "Your parcel has left the country of origin and is being shipped.",
  "LIV_CFM": "Your parcel was delivered",
  "ECH_CFM": "Your parcel was collected from your mailbox.",
  "LIV_GAR": "Your parcel has been delivered to the caretaker.",
  "LIV_REO": "Your parcel has been delivered to the sender following a return.",
  "LIV_RTI": "Your parcel has been delivered to the caretaker or to a neighbour.",
  "LIV_VOI": "Your parcel has been delivered to the neighbour indicated on the notice posted in the addressee's mailbox.",
  "MLV_ARS": "Your parcel is available at the choosen pick-up location. The consignee has 10 business days to pick-up their parcel upon presentation of their pending notice and proof of identity.",
  "MLV_CFM": "Your parcel is being delivered to a pick-up location.",
  "PCH_CFM": "Your parcel is being processed by La Poste, it is currently shipped",
  "PCH_CEX": "Your parcel is being processed by La Poste, it is currently shipped",
  "RCD_DVY": "Your parcel is being redirected to another distribution site due to an addressing problem.",
  "REN_ARV": "Your parcel could not be delivered because the addressee was absent. We will try to deliver it on the next working day.",
  "REN_AVA": "Your parcel has been returned to the sender following a refusal by the addressee.",
  "REN_AVI": "Your parcel could not be delivered. It will be made available in the addressee's post office.",
  "REN_CAD": "Your parcel cannot be delivered to its addressee at the moment because the delivery address is incomplete. The addressee can contact our customer service to provide the necessary additional information, by clicking on Contact Us online.",
  "REN_DIA": "Your parcel could not be delivered. It has been returned to the sender.",
  "REN_DID": "Your parcel has not be picked up within the allocated time. It has been returned to the sender.",
  "REN_DIV": "Your parcel has been returned to the sender following a refusal by the addressee.",
  "REN_FCO": "Your parcel cannot be delivered to the chosen pick-up location. The addressee will be informed of the new delivery location.",
  "REN_LNA": "Your parcel has been re-shipped at the addressee's request to the address of their choice. ",
  "REN_NRV": "Your parcel could not be delivered because the addressee was absent. We will try to deliver it as soon as possible.",
  "REN_SNC": "Your parcel has been returned to the sender following a refusal by the addressee.",
  "REN_SRB": "Your parcel has been returned to the sender following a refusal by the addressee.",
  "REN_TAR": "Your parcel has been returned to the sender following a refusal by the addressee.",
  "RST_DIL": "Your parcel will be delivered by apointment at the addressee's choosen date",
  "RST_FHB": "Your parcel could not be delivered today since the delivery address is not accessible. We will try to deliver it as soon as possible.",
  "RST_FMA": "Your parcel could not be delivered today since the delivery address is not accessible. We will try to deliver it as soon as possible.",
  "RST_NCG": "Your parcel cannot be delivered today. We will try to deliver it as soon as possible.",
  "SOL_MQD": "Your parcel has suffered an incident. Please contact our customer service.",
  "SOL_REO": "Your parcel has been returned to the sender.",
  "RST_NRV": "Your parcel will be delivered on the next working day and requires delivery to you in person. If you are away, you can let us know what your instructions are on www.colissimo.fr/monchoix.",
  "DCH_CFM": "Your parcel has arrived in the destination country",
  "DCH_DDT": "Your parcel has left the office of exchange It is currently being routed in the destination country",
  "DCH_DDC": "Your parcel is under customs clearance",
  "DOU_FCM": "Your parcel has been retained by our services due to an invoice problem. The parcel addressee will be contacted.",
  "DOU_EXP": "Your parcel is being shipped.",
  "DOU_DOU": "Your parcel is undergoing customs clearance.",
  "PCH_TAR": "Your parcel has been dropped-off at the post office after the deposit deadline, it will be shipped the next Business Day.",
  "CORREOS_ERROR_1": "The destination postcode is not valid",
  "CORREOS_ERROR_2": "The customer / contract / annex / type of postage is not valid",
  "CORREOS_ERROR_3": "The product is not allowed in the indicated country",
  "CORREOS_ERROR_4": "Insurance is not allowed",
  "CORREOS_ERROR_5": "Insurance cannot be 0",
  "CORREOS_ERROR_6": "The insurance amount is incorrect",
  "CORREOS_ERROR_7": "Reimbursement is not allowed",
  "CORREOS_ERROR_8": "Reimbursement cannot be 0",
  "CORREOS_ERROR_9": "The reimbursement amount is incorrect",
  "CORREOS_ERROR_10": "The account number is not valid for reimbursement in an account",
  "CORREOS_ERROR_11": "The sender’s postcode is not valid",
  "CORREOS_ERROR_12": "The sender’s tax identification number is not valid",
  "CORREOS_ERROR_13": "The addressee’s tax identification number is not valid",
  "CORREOS_ERROR_14": "Volumetric weight data are missing",
  "CORREOS_ERROR_15": "The sum of the parcel’s sizes is higher than 200 cm",
  "CORREOS_ERROR_16": "The indicated volumetric weight is not in line with the parcel size",
  "CORREOS_ERROR_17": "Exclusive delivery to the addressee is not allowed",
  "CORREOS_ERROR_18": "A description of the goods is required for this type of shipment",
  "CORREOS_ERROR_19": "The declared value of the goods cannot be 0",
  "CORREOS_ERROR_20": "The destination branch is not valid",
  "CORREOS_ERROR_21": "The sender’s address is compulsory",
  "CORREOS_ERROR_22": "The tariff for this shipment has not been recovered",
  "CORREOS_ERROR_23": "There is not franking machine",
  "CORREOS_ERROR_24": "The franking machine does not belong to the same Provincial Headquarters as the branch",
  "CORREOS_ERROR_25": "Insufficient postage",
  "CORREOS_ERROR_26": "The reimbursement type cannot be empty",
  "CORREOS_ERROR_27": "The account number is not valid for a reimbursement in an account",
  "CORREOS_ERROR_28": "The type of shipment is compulsory",
  "CORREOS_ERROR_29": "For this shipment, please enter the addressee's mobile number",
  "CORREOS_ERROR_30": "The addressee’s telephone number must be a valid mobile",
  "CORREOS_ERROR_31": "The postage type is not valid",
  "CORREOS_ERROR_32": "The destination CPI has not been provided",
  "CORREOS_ERROR_33": "The contract / customer does not have an annex for this product",
  "CORREOS_ERROR_34": "Acknowledgement of receipt is not allowed",
  "CORREOS_ERROR_35": "The weight is not valid",
  "CORREOS_ERROR_36": "The addressee’s address is compulsory",
  "CORREOS_ERROR_37": "The shipment code has already been pre-registered in the platform",
  "CORREOS_ERROR_38": "The shipment code has already been registered in the platform",
  "CORREOS_ERROR_39": "The shipment code is empty",
  "CORREOS_ERROR_40": "The scopes do not coincide",
  "CORREOS_ERROR_41": "The addressee’s name is empty",
  "CORREOS_ERROR_42": "The sender’s name is empty",
  "CORREOS_ERROR_43": "The sender’s surnames are empty",
  "CORREOS_ERROR_44": "The addressee’s surnames are empty",
  "CORREOS_ERROR_45": "Message format error",
  "CORREOS_ERROR_46": "IRIS6 error",
  "CORREOS_ERROR_47": "IRIS6 error",
  "CORREOS_ERROR_50": "Pre-registration error",
  "CORREOS_ERROR_51": "The file version is not valid",
  "CORREOS_ERROR_52": "Duplicate certificate code",
  "CORREOS_ERROR_53": "The postage type is not valid",
  "CORREOS_ERROR_54": "There is no addressee’s name or company",
  "CORREOS_ERROR_55": "The destination city is compulsory",
  "CORREOS_ERROR_56": "The sender’s name or company is compulsory",
  "CORREOS_ERROR_57": "The reimbursement type is necessary",
  "CORREOS_ERROR_58": "Only one customer details are allowed per file",
  "CORREOS_ERROR_59": "Product not valid",
  "CORREOS_ERROR_60": "The customer code does not coincide with the product code",
  "CORREOS_ERROR_61": "The certificate code does not allow added values (except for physical acknowledgement of receipt)",
  "CORREOS_ERROR_62": "The certificate code control digit is incorrect",
  "CORREOS_ERROR_63": "Duplicate certificate in the actual file",
  "CORREOS_ERROR_64": "The shipment has been correctly cancelled",
  "CORREOS_ERROR_65": "The shipment has already been registered",
  "CORREOS_ERROR_66": "The shipment has already been deregistered",
  "CORREOS_ERROR_67": "The shipment has not been pre-registered",
  "CORREOS_ERROR_68": "The shipment status code is incorrect",
  "CORREOS_ERROR_69": "A prepaid shipment cannot have V A",
  "CORREOS_ERROR_70": "The shipment amount has not been provided",
  "CORREOS_ERROR_71": "The shipment promotion amount has not been provided",
  "CORREOS_ERROR_72": "The sender's city is compulsory",
  "CORREOS_ERROR_73": "The labelling code is not valid",
  "CORREOS_ERROR_74": "The manifest number is compulsory",
  "CORREOS_ERROR_75": "A contact person at the destination company must be specified",
  "CORREOS_ERROR_76": "A contact person at the sending company must be specified",
  "CORREOS_ERROR_77": "Empty shipment list or the shipments have not been translated",
  "CORREOS_ERROR_78": "Compulsory data are missing",
  "CORREOS_ERROR_79": "The product and delivery type are incompatible",
  "CORREOS_ERROR_80": "The customer / contract is compulsory",
  "CORREOS_ERROR_81": "The labelling code is compulsory",
  "CORREOS_ERROR_82": "The amount of the first article contained in the shipment is compulsory",
  "CORREOS_ERROR_83": "The labelling code does not exist in the databases",
  "CORREOS_ERROR_84": "There is more than one labelling code in the databases",
  "CORREOS_ERROR_85": "Error when validating the labelling code",
  "CORREOS_ERROR_86": "It is compulsory to state if the shipment has an invoice of more than 500 euros",
  "CORREOS_ERROR_87": "It is compulsory to state if the DUA export will be handled by Correos",
  "CORREOS_ERROR_88": "It is compulsory to state the addressee’s name or company",
  "CORREOS_ERROR_89": "It is compulsory to state the sender’s name or company",
  "CORREOS_ERROR_90": "The certificate code must have 13 or 23 characters",
  "CORREOS_ERROR_91": "Scope not found",
  "CORREOS_ERROR_92": "The reimbursement type is not valid",
  "CORREOS_ERROR_93": "The addressee’s address is incomplete",
  "CORREOS_ERROR_94": "The sender’s address is incomplete",
  "CORREOS_ERROR_95": "The amount has not been provided before the promotions",
  "CORREOS_ERROR_96": "The tax has not been provided before the promotions",
  "CORREOS_ERROR_97": "The amount has not been provided after the promotions",
  "CORREOS_ERROR_98": "The tax has not been provided after the promotions",
  "CORREOS_ERROR_99": "Compulsory information is missing for accepting a reimbursement in a P. O. box",
  "CORREOS_ERROR_100": "The amount of the franking machine is insufficient",
  "CORREOS_ERROR_101": "The net weight has not been provided",
  "CORREOS_ERROR_102": "The certificate code of an international shipment must have 13 characters",
  "CORREOS_ERROR_103": "The shipment has expired and cannot be accepted",
  "CORREOS_ERROR_104": "The certificate code is not valid for this type of product",
  "CORREOS_ERROR_105": "The P. O. box number does not exist for the indicated branch",
  "CORREOS_ERROR_106": "Indicate what to do with the parcel if not delivered",
  "CORREOS_ERROR_107": "Indicate a contact person at the addressee’s company",
  "CORREOS_ERROR_108": "Indicate the addressee’s mail address",
  "CORREOS_ERROR_109": "Compulsory information is missing for customs",
  "CORREOS_ERROR_110": "The sum of the parcel’s sizes is higher than 210 cm",
  "CORREOS_ERROR_111": "Error when generating the certificate code with the data received",
  "CORREOS_ERROR_112": "The customer is not authorised to pre-register this shipment",
  "CORREOS_ERROR_141": "HOMEPAQ code is not valid",
  "CORREOS_ERROR_164": "Transport company code is not valid",
  "CORREOS_ERROR_171": "Fields concerning to Reverse Logistic LI only be filled if pre-registering Reverse Logistic LI must be done",
  "UPS_AA": "THE SUITE NUMBER IS EITHER MISSING OR INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AB": "THE RECEIVER IS NOT LISTED IN THE BUILDING DIRECTORY. WE ARE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_AC": "THE CITY NAME IN THE ADDRESS IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AD": "THE COMPANY OR RECEIVER NAME IS INCORRECT. THIS WILL DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_AE": "THE STREET NUMBER IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AF": "THE STREET NAME IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AH": "THE ADDRESS HAS BEEN CORRECTED. THE DELIVERY HAS BEEN RESCHEDULED.",
  "UPS_AI": "WE'RE WORKING TO DELIVER YOUR PACKAGE AS SOON AS POSSIBLE.",
  "UPS_AK": "THE STATE SHOWN IN THE ADDRESS IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AL": "THE POSTAL CODE FOR THE RECEIVER IS INCORRECT. WE ARE ATTEMPTING TO OBTAIN CORRECT POSTAL CODE TO COMPLETE DELIVERY.",
  "UPS_AM": "THE RECEIVER HAS CANCELED THE PRODUCT ORDER AND REFUSED DELIVERY.",
  "UPS_AN": "THE RECEIVER DETERMINED THIS IS A DUPLICATE PRODUCT ORDER AND HAS REFUSED THE DELIVERY.",
  "UPS_AO": "THE CURRENCY TYPE IS MISSING FROM THE PACKAGE DOCUMENTATION. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_AP": "THE RECEIVER HAD NO INVOICE INFORMATION FOR THIS PACKAGE AND HAS REFUSED THE DELIVERY.",
  "UPS_AQ": "THE RECEIVER DOESN'T ACCEPT C.O.D.S AND REFUSED THE DELIVERY.",
  "UPS_AS": "THE RECEIVER DETERMINED  THIS PRODUCT ORDER IS LATE AND HAS REFUSED THE DELIVERY.",
  "UPS_AV": "RECEIVER'S ADDRESS IS A RURAL ROUTE. A STREET HAS NOT BEEN ASSIGNED. UPS IS ATTEMPTING TO ESTABLISH A DELIVERY LOCATION.",
  "UPS_AW": "YOUR PACKAGE CANNOT BE DELIVERED TO A RURAL ROUTE ADDRESS. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AX": "THE RECEIVER IS ON VACATION.",
  "UPS_AY": "THE RECEIVING BUSINESS WAS CLOSED AT THE TIME OF THE FINAL DELIVERY ATTEMPT.",
  "UPS_AZ": "DELIVERY HAS BEEN RESCHEDULED DUE TO HOLIDAY CLOSURES.",
  "UPS_A5": "THE RECEIVER'S LOCATION WAS DAMAGED BY FIRE. WE'RE ATTEMPTING TO DETERMINE AN ALTERNATE DELIVERY ADDRESS.",
  "UPS_A6": "YOUR PACKAGE CANNOT BE DELIVERED TO A P.O. BOX. WE'RE ATTEMPTING TO OBTAIN AN ALTERNATE DELIVERY ADDRESS.",
  "UPS_A7": "THE RECEIVER HAS MOVED. WE'RE  ATTEMPTING TO OBTAIN A NEW DELIVERY ADDRESS FOR THIS RECEIVER.",
  "UPS_A8": "THE APARTMENT NUMBER IS EITHER MISSING OR INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_A9": "DIRECTIONS TO THE ADDRESS ARE REQUIRED TO COMPLETE DELIVERY. WE ARE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_BA": "ADDITIONAL DOCUMENTATION IS REQUIRED ON THE MERCHANDISE DESCRIPTION.",
  "UPS_BB": "THE SHIPMENT VALUE IS MISSING FROM THE INVOICE AND IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BD": "SHIPPER EXPORT DECLARATION DOCUMENTATION REQUIRED FOR EXPORT IS MISSING. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BE": "EXPORT LICENSE DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BF": "WE'RE ATTEMPTING TO GET FURTHER INSTRUCTIONS AND MAY RETURN THE SHIPMENT.",
  "UPS_BG": "TRANSIT OR BOND DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BH": "POWER OF ATTORNEY DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BJ": "AN IMPORT LICENSE IS MISSING AND IS REQUIRED FOR CLEARANCE",
  "UPS_BK": "CERTIFICATE OF ORIGIN DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BP": "A PHONE NUMBER IS REQUIED FOR CLEARANCE OR DELIVERY. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BQ": "WE'VE ATTEMPTED TO CONTACT THE RECEIVER REGARDING PICKUP ARRANGEMENTS.",
  "UPS_BR": "WE'VE LEFT A MESSAGE FOR THE RECEIVER TO CONTACT US.",
  "UPS_BT": "WE'VE CONTACTED THE RECEIVER TO REQUEST ADDITIONAL INFORMATION.",
  "UPS_BU": "AS REQUESTED, THE PACKAGE WAS TRANSFERRED TO A FREE TRADE ZONE OR A NON-UPS BROKER.",
  "UPS_BV": "THE SHIPMENT IS BEING HELD BY BROKERAGE FOR REASONS BEYOND UPS' CONTROL",
  "UPS_BW": "YOUR PACKAGE HAS BEEN DELAYED DUE TO AN AGRICULTURAL HOLD.",
  "UPS_BX": "YOUR PACKAGE HAS BEEN DELAYED BY A CLEARANCE AGENCY WORK STOPPAGE.",
  "UPS_BZ": "THIS PACKAGE WAS ABANDONED BY BOTH THE SENDER AND RECEIVER.",
  "UPS_B1": "A WORK STOPPAGE AT THE RECEIVER'S LOCATION HAS PREVENTED DELIVERY.",
  "UPS_B3": "YOUR PACKAGE IS BEING PROCESSED FOR SUBMISSION TO THE FDA OR DEPARTMENT OF AGRICULTURE.",
  "UPS_B4": "YOUR PACKAGE HAS BEEN DELAYED DUE TO A FISH AND WILDLIFE AGENCY HOLD.",
  "UPS_B5": "A VALID TAX ID OR DEFERMENT NUMBER IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_B6": "A SPECIAL CUSTOMS CLEARANCE PROCEDURE IS REQUIRED FOR LIVE ENTRY.",
  "UPS_B8": "YOUR PACKAGE HAS BEEN DELAYED BY A CLEARANCE AGENCY. A HOLD WAS PLACED ON THE AIRPLANE.",
  "UPS_B9": "A MISSING COMMERCIAL INVOICE IS CAUSING A DELAY.",
  "UPS_CC": "WE'VE LEFT THE PACKAGE IN ONE OF OUR VEHICLES. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_CE": "THE PACKAGE CONTAINS A RESTRICTED COMMODITY. WE'LL PROCESS ACCORDING TO STANDARD PROTOCOL.",
  "UPS_CF": "WE DO NOT ACCEPT PACKAGES REQUIRING CARNET DOCUMENTATION.",
  "UPS_CG": "THE PACKAGE CONTAINS MULTIPLE, DIFFERING TRACKING NUMBERS.",
  "UPS_CH": "THE PACKAGE CONTAINS MULTIPLE, DUPLICATE TRACKING NUMBERS.",
  "UPS_CJ": "THE TRACKING NUMBER ON THIS PACKAGE HAS BEEN ALTERED/CHANGED",
  "UPS_CM": "A FLIGHT CANCELATION HAS DELAYED DELIVERY. WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_CN": "YOUR PACKAGE HAS BEEN DELAYED DUE TO AN EXPORT GATEWAY HOLD.",
  "UPS_CP": "YOUR PACKAGE HAS BEEN DELAYED DUE TO AN IMPORT GATEWAY HOLD.",
  "UPS_CQ": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_CS": "THE SENDER REQUESTED THAT WE RETURN THIS PACKAGE.",
  "UPS_CV": "YOUR PACKAGE EXCEEDS THE MAXIMUM WEIGHT WE CAN ACCEPT.",
  "UPS_CW": "WE CANNOT DELIVER TO AN APO OR FPO ADDRESS. WE'RE ATTEMPTING TO DETERMINE AN ALTERNATE DELIVERY ADDRESS.",
  "UPS_CX": "EXPORT DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_CY": "WE WERE UNABLE TO OBTAIN COMPLETE  ADDRESS INFORMATION FOR YOUR PACKAGE.",
  "UPS_CZ": "HAZARDOUS MATERIALS LABELING IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_C1": "TRANSFERRED TO A LOCAL AGENT FOR DELIVERY. THE DELIVERY WILL BE RESCHEDULED.",
  "UPS_C3": "THE CONTENTS OF YOUR PACKAGE ARE SUBJECT TO EXPORT RESTRICTIONS AND MAY CAUSE A DELIVERY DELAY.",
  "UPS_C4": "THE RECEIVER WAS NOT AVAILABLE AT THE TIME OF THE DELIVERY ATTEMPT.",
  "UPS_C5": "AN EMERGENCY SITUATION OR SEVERE WEATHER CONDITION HAS DELAYED DELIVERY.",
  "UPS_C6": "DELIVERY WILL BE DELAYED BY ONE BUSINESS DAY.",
  "UPS_C7": "THE C.O.D. AMOUNT IS MISSING FROM THE LABEL. WE'RE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_C8": "THE RECEIVER IS NO LONGER IN BUSINESS.",
  "UPS_C9": "YOUR PACKAGE EXCEEDS THE MAXIMUM LENGTH WE CAN ACCEPT.",
  "UPS_DA": "YOUR PACKAGE WAS RELEASED BY THE CLEARING AGENCY.",
  "UPS_DB": "YOUR PACKAGE WILL BE HELD AT A WAREHOUSE UNTIL IT IS RELEASED BY THE CLEARANCE AGENCY.",
  "UPS_DC": "YOUR PACKAGE ARRIVED LATE TO THE DESTINATION CITY. YOU SHOULD EXPECT AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_DD": "WE'RE UNABLE TO CONTACT THE RECEIVER.",
  "UPS_DE": "CLEARING AGENCY IS REQUIRING AN INVOICE COMPARISON TO THE ITEMS BEING SHIPPED",
  "UPS_DF": "A NATURAL DISASTER HAS DELAYED DELIVERY. WE ARE READY TO DELIVER AS SOON AS CONDITIONS ALLOW.",
  "UPS_DG": "CIVIL UNREST HAS DELAYED DELIVERY. WE ARE READY TO DELIVER AS SOON AS CONDITIONS ALLOW.",
  "UPS_DH": "YOUR PACKAGE HAS BEEN DELAYED DUE TO EVENTS BEYOND OUR CONTROL. WE'RE ADJUSTING DELIVERY PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_DJ": "SEVERE WEATHER CONDITIONS HAVE DELAYED DELIVERY.",
  "UPS_DN": "THE NUMBER OF PACKAGES DOES NOT MATCH THE INVOICE, WAYBILL OR LABEL. WE'RE WORKING TO RESOLVE THIS DISCREPANCY.",
  "UPS_DQ": "THIS DELIVERY ADDRESS IS IN A REMOTE AREA WHERE DELIVERIES ARE NOT MADE DAILY.",
  "UPS_DR": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_DT": "WE'VE CONTACTED THE RECEIVER TO REQUEST ADDITIONAL INFORMATION.",
  "UPS_DU": "WE WERE UNABLE TO LOAD THE PACKAGE ON THE PLANE AS SCHEDULED.",
  "UPS_DW": "THE DELIVERY LOCATION IS VACANT.",
  "UPS_DY": "WE ARE AWAITING PAYMENT AUTHORIZATION FROM THE RECEIVER.",
  "UPS_D1": "WE'VE MISROUTED THE PACKAGE. THIS MAY CAUSE A DELAY.",
  "UPS_D2": "THE COMMODITY VALUE OF YOUR PACKAGE EXCEEDS THE LIMIT WE ALLOW.",
  "UPS_D4": "THE SERVICE SELECTED IS NOT AVAILABLE TO THIS DESTINATION ADDRESS. THIS HAS DELAYED DELIVERY.",
  "UPS_D7": "WE'LL CONTACT THE SENDER OR RECEIVER ABOUT THIS DELIVERY.",
  "UPS_ED": "WE'VE LEFT THE PACKAGE IN ONE OF OUR CONTAINERS. THIS MAY CAUSE A DELAY.",
  "UPS_EH": "YOUR PACKAGE MAY BE DELAYED. WE ARE ADJUSTING DELIVERY PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_EN": "YOUR PACKAGE MAY BE DELAYED. WE ARE ADJUSTING DELIVERY PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_EO": "WE'VE ARRANGED A SPECIAL FLIGHT TO COMPLETE YOUR DELIVERY.",
  "UPS_ER": "YOUR PACKAGE IS AWAITING RELEASE FROM THE CLEARING AGENCY.",
  "UPS_ES": "YOUR PACKAGE ENTRY WAS REJECTED BY THE CLEARING AGENCY. WE WILL PROCESS ACCORDING TO THE SENDER'S INSTRUCTIONS.",
  "UPS_EU": "DOCUMENTATION REQUIRED FOR IMPORT IS INCOMPLETE OR MISSING. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_EV": "ADDITIONAL DOCUMENTATION IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_EW": "TRANSLATED DOCUMENTS ARE REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_EX": "YOUR PACKAGE EXCEEDS THE MAXIMUM WEIGHT WE CAN ACCEPT.",
  "UPS_E1": "THE FLOOR NUMBER IS EITHER MISSING OR INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_E2": "PACKAGE MUST BE PICKED UP WITHIN 5 BUSINESS DAYS.",
  "UPS_E3": "WE LEFT THE PACKAGE IN OUR FACILITY. THIS MAY CAUSE A DELAY. WE WILL DELIVER AS QUICKLY AS POSSIBLE.",
  "UPS_E4": "YOUR PACKAGE HAS BEEN DELAYED DUE TO A GOVERNMENT REGULATORY AGENCY HOLD.",
  "UPS_E8": "YOUR PACKAGE WAS QUARANTINED AS REQUESTED BY A GOVERNMENT REGULATORY AGENCY.",
  "UPS_E9": "YOUR PACKAGE WAS HELD FOR CENSORSHIP REVIEW BY A GOVERNMENT AGENCY.",
  "UPS_FA": "WE WERE UNABLE TO OBTAIN ADDITIONAL ADDRESS INFORMATION.",
  "UPS_FE": "THE RECEIVER DISPUTES OR REFUSES TO PAY DUTY OR TAXES FOR THE PACKAGE.",
  "UPS_FF": "WE ARE AWAITING RETURN TO SENDER AUTHORIZATION FOR THE PACKAGE.",
  "UPS_FK": "THE PACKAGE WAS RETURNED USING THE RETURN LABEL PROVIDED.",
  "UPS_FM": "AN ADULT SIGNATURE IS REQUIRED TO COMPLETE THIS DELIVERY. UPS WILL MAKE A FINAL ATTEMPT.",
  "UPS_FN": "RECEIVER ACKNOWLEDGES RECEIPT",
  "UPS_FT": "THE RECEIVER HAS PICKED UP THEIR PACKAGE.",
  "UPS_FW": "WE'VE REQUESTED A UPS PROACTIVE RESPONSE INTERCEPT FOR THIS PACKAGE.",
  "UPS_F4": "DELIVERED",
  "UPS_GF": "ADDITIONAL INFORMATION IS NEEDED FROM THE IMPORTER TO PROVIDE DUTY RELIEF FOR SHIPMENT REPAIRED AT ORIGIN.",
  "UPS_GH": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_GI": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_GZ": "A LETTER OF CREDIT IS IN PROGRESS. YOUR PACKAGE WILL BE HELD UNTIL APPROVAL IS COMPLETE.",
  "UPS_G1": "AS REQUESTED BY THE SENDER, THE PACKAGE WILL BE DELIVERED LATER THAN THE NORMAL DELIVERY TIME FOR YOUR AREA.",
  "UPS_G3": "THE RECEIVING BUSINESS WAS CLOSED AT THE TIME OF THE FIRST DELIVERY ATTEMPT. A SECOND ATTEMPT WILL BE MADE.",
  "UPS_G4": "THE PACKAGE WAS NOT READY AT THE TIME OF THE FIRST PICKUP ATTEMPT. A SECOND ATTEMPT WILL BE MADE.",
  "UPS_G5": "THE PACKAGE WAS NOT READY FOR PICKUP AT THE TIME OF THE FINAL ATTEMPT.",
  "UPS_G6": "A REQUIRED SECURITY CHECK HAS DELAYED DELIVERY.",
  "UPS_G7": "AN ADULT SIGNATURE IS REQUIRED TO COMPLETE THIS DELIVERY. UPS WILL MAKE A SECOND ATTEMPT.",
  "UPS_G8": "UPS WAS NOT ABLE TO SECURE AN ADULT SIGNATURE FOR THIS DELIVERY. DELIVERY WAS NOT MADE.",
  "UPS_G9": "YOUR PACKAGE MAY BE DELAYED DUE TO A REQUIRED X-RAY INSPECTION.",
  "UPS_HA": "A TRANSPORTATION ACCIDENT HAS DELAYED DELIVERY.",
  "UPS_HF": "PICKUP SCAN",
  "UPS_HJ": "YOUR PACKAGE WAS UPGRADED TO A NEW SERVICE LEVEL.",
  "UPS_HK": "THIS PACKAGE CONTAINS ALCOHOL AND WE ARE UNABLE TO DELIVER OR RETURN IT TO THE SENDER. WE'LL CONTACT THE SENDER.",
  "UPS_HL": "YOUR PACKAGE WAS PROCESSED AT OUR FACILITY",
  "UPS_HM": "THE PACKAGE HAS BEEN REDIRECTED AND FORWARDED TO THE DELIVERY CENTER.",
  "UPS_HO": "THIS PACKAGE CONTAINS ALCOHOL AND WILL BE HELD FOR PICKUP BY THE SENDER ONLY.",
  "UPS_HQ": "WE'VE LEFT A NOTICE ABOUT THE PACKAGE.",
  "UPS_HR": "THE PACKAGE WAS DAMAGED IN TRANSIT. WE WILL NOTIFY THE SENDER WITH DETAILS.",
  "UPS_H1": "THE STREET TYPE SHOWN IN THE ADDRESS IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_H2": "THE STREET PREFIX IS EITHER MISSING OR INCORRECT. THIS MAY DELAY DELIVERY.  WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_H3": "THE STREET SUFFIX IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_H4": "THE BOROUGH OR COUNTY SHOWN IN THE ADDRESS IS INCORRECT AND MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_H5": "INCOMPLETE ADDRESS INFORMATION MAY DELAY DELIVERY. WE ARE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_H6": "WE RECEIVED A REQUEST TO CHANGE DELIVERY. THIS REQUEST WILL BE PROCESSED ONCE THE PACKAGE RETURNS TO OUR FACILITY.",
  "UPS_H7": "THE DELIVERY AREA IS INACCESSIBLE DUE TO A SPECIAL EVENT. WE'RE ADJUSTING PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_H8": "THE PACKAGE IS BEING RETURNED TO THE SENDER AT A DIFFERENT SERVICE LEVEL.",
  "UPS_H9": "A HAZARDOUS MATERIALS IRREGULARITY OCCURRED WITH THIS PACKAGE. WE'LL CONTACT THE SENDER WITH ADDITIONAL INFORMATION.",
  "UPS_IJ": "THE DELIVERY IS RESCHEDULED.",
  "UPS_I1": "AS REQUESTED BY THE SENDER, THE PACKAGE IS BEING RETURNED. CONACT THE SENDER FOR ADDITIONAL INFORMATION.",
  "UPS_I2": "THIS PACKAGE CONTAINS ALCOHOL AND WE ARE UNABLE TO DELIVER OR RETURN IT TO THE SENDER. WE'LL CONTACT THE SENDER.",
  "UPS_I3": "YOU CAN MAKE ALTERNATE DELIVERY ARRANGEMENTS BY CALLING 1-800-457-4022 AND ENTERING YOUR TRACKING NUMBER.",
  "UPS_JA": "AS REQUESTED BY THE SENDER, THE DELIVERY CHANGE FOR THIS PACKAGE WAS COMPLETED.",
  "UPS_JB": "WE HAVE UPDATED THE DELIVERY INFORMATION FOR YOUR PACKAGE.",
  "UPS_JC": "THE UPS PROACTIVE RESPONSE INTERCEPT FOR YOUR PACKAGE WAS COMPLETED.",
  "UPS_JH": "THE SENDER REQUESTED A MODIFIED INTERCEPT FOR THIS PACKAGE.",
  "UPS_JI": "WE'VE REQUESTED A MODIFIED INTERCEPT FOR THIS PACKAGE.",
  "UPS_JJ": "THE UPS PROACTIVE RESPONSE INTERCEPT FOR YOUR PACKAGE WAS MODIFIED.",
  "UPS_J8": "DISPATCH FOR ONE ADDITIONAL DAY",
  "UPS_J9": "REFRIGERATE",
  "UPS_KI": "THE RECEIVER REFUSED TO PAY THE C.O.D. AMOUNT FOR THIS PACKAGE.",
  "UPS_KM": "THE PACKAGE WAS DELIVERED AT THE RECEIVER'S LOCATION.",
  "UPS_KN": "THE RECEIVER CHOSE TO KEEP THE PACKAGE.",
  "UPS_KO": "WE'VE CONTACTED THE RECEIVER.",
  "UPS_KP": "THE PACKAGE WILL BE RETURNED TO THE SENDER.",
  "UPS_KR": "THE RECEIVER DOES NOT WANT THE PRODUCT AND REFUSED THE DELIVERY.",
  "UPS_KS": "THE RECEIVER STATES THE PRODUCT WAS NOT ORDERED AND HAS REFUSED THE DELIVERY.",
  "UPS_KT": "THE RECEIVER REFUSED THE DELIVERY.",
  "UPS_KX": "THE RECEIVER WAS NOT AVAILABLE AT THE TIME OF THE SECOND DELIVERY ATTEMPT. A FINAL ATTEMPT WILL BE MADE.",
  "UPS_KY": "THE PACKAGE WAS NOT READY AT THE TIME OF THE SECOND PICKUP ATTEMPT. A FINAL ATTEMPT WILL BE MADE.",
  "UPS_KZ": "THE DRIVER WAS UNABLE TO COLLECT FUNDS ON THE SECOND DELIVERY ATTEMPT. A FINAL ATTEMPT WILL BE MADE.",
  "UPS_K1": "WE'VE MISSED THE SCHEDULED PICKUP TIME. THIS MAY CAUSE A DELAY.",
  "UPS_K2": "SENDER TENDERED THE SHIPMENT TO UPS AFTER THE LATEST PICKUP TIME FOR THE REQUESTED SERVICE. A DAY DELAY IS LIKELY.",
  "UPS_K5": "A GUARANTEED SERVICE REFUND HAS BEEN REQUESTED FOR THIS PACKAGE.",
  "UPS_K6": "A GUARANTEED SERVICE REFUND HAS BEEN VOIDED FOR THIS PACKAGE.",
  "UPS_K7": "THE RECEIVER HAS ACKNOWLEDGED RECEIPT OF THIS PACKAGE.",
  "UPS_K8": "A UPS PROACTIVE RESPONSE INTERCEPT FOR THIS PACKAGE HAS BEEN COMPLETED.",
  "UPS_LE": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_LF": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_LH": "SATURDAY GUARANTEED SERVICE IS NOT AVAILABLE IN THE DESTINATION ZIP CODE.",
  "UPS_LI": "THE SHIPMENT IS BEING HELD IN THE LOGISTICS LOCATION FOR A FUTURE DELIVERY DATE.",
  "UPS_LN": "THE DAMAGE INSPECTION REQUEST HAS BEEN CHANGED.",
  "UPS_LO": "THE DAMAGE INSPECTION REQUEST HAS BEEN REISSUED.",
  "UPS_LQ": "WE'VE SCHEDULED AN INSPECTION OF THE DAMAGED CONTENTS AND PACKAGING. WE'LL PROVIDE THE SENDER WITH THE RESULTS.",
  "UPS_LV": "YOUR PACKAGE WAS FORWARDED TO A GOVERNMENT AGENCY FOR INVESTIGATION.",
  "UPS_LX": "PACKAGE TRANSFERRED TO POST OFFICE",
  "UPS_LY": "THE SHIPMENT IS IN TRANSIT FOR FINAL DELIVERY. DELIVERY IS SCHEDULED IN APPROXIMATELY 1-2 DAYS.",
  "UPS_LZ": "AT THE SENDER'S REQUEST, WE'LL MAKE ONLY ONE DELIVERY ATTEMPT. THE RECEIVER MUST PICK UP THE PACKAGE AT A UPS FACILITY.",
  "UPS_L1": "THE RECEIVING BUSINESS WAS CLOSED AT THE TIME OF THE SECOND DELIVERY ATTEMPT. A FINAL ATTEMPT WILL BE MADE.",
  "UPS_L2": "DUE TO A PRICE DISCREPANCY, THE RECEIVER HAS REFUSED TO PAY THE CHARGES.",
  "UPS_L3": "A GOVERNMENT AGENCY HAS REQUESTED A RE-EVALUATION OF THE INVOICED PACKAGE VALUE.",
  "UPS_L5": "THE DESCRIPTION OF THE CONTENTS OF YOUR PACKAGE DOES NOT MATCH THE DOCUMENTATION.",
  "UPS_MF": "THE RECEIVER HAS REQUESTED THAT WE HOLD THIS PACKAGE FOR A FUTURE DELIVERY DATE",
  "UPS_MI": "YOUR PACKAGE WAS RETURNED TO THE IMPORT SITE AND IS AWAITING CLEARANCE.",
  "UPS_MT": "WE'VE MISSED THE SCHEDULED TRANSFER TIME. THIS MAY CAUSE A DELAY.",
  "UPS_NI": "THE PACKAGE WAS DISCARDED AT THE SENDER'S REQUEST. PLEASE CONTACT THE SENDER FOR DETAILS.",
  "UPS_NV": "WE'VE RECEIVED PAYMENT AND WILL DELIVER YOUR PACKAGE.",
  "UPS_OM": "MISSING INFORMATION FROM THE SENDER MAY DELAY DELIVERY. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_OQ": "YOUR PACKAGE IS BEING HELD FOR PAYMENT OF DUTY AND TAX.",
  "UPS_OS": "YOUR PACKAGE IS BEING DELAYED DUE TO THE PROCESSING INVOLVED WITH HANDLING LITHIUM BATTERIES.",
  "UPS_O1": "A DELIVERY CHANGE FOR THIS PACKAGE IS IN PROGRESS.",
  "UPS_O2": "WE'VE MODIFIED THE REQUESTED CHANGE OF DELIVERY FOR YOUR PACKAGE.",
  "UPS_O3": "WE RECEIVED AN ADDITIONAL REQUEST TO CHANGE THE DELIVERY OF THIS PACKAGE. THE REQUEST IS IN PROGRESS.",
  "UPS_O4": "THE PACKAGE WILL BE RETURNED TO THE SENDER.",
  "UPS_O5": "THE RECEIVER ARRANGED TO PICK UP THE PACKAGE AT A UPS FACILITY.",
  "UPS_O6": "WE'VE RESCHEDULED THIS DELIVERY.",
  "UPS_O7": "YOUR PACKAGE WILL BE DELIVERED TO AN ALTERNATE ADDRESS.",
  "UPS_O8": "THE RECEIVER ARRANGED TO PICK UP THIS PACKAGE AT A UPS FACILITY.",
  "UPS_O9": "THE RECEIVER ARRANGED FOR SAME-DAY WILL CALL.",
  "UPS_PI": "THE RECEIVER DID NOT PRESENT PROPER IDENTIFICATION CONTAINING THE DELIVERY ADDRESS.",
  "UPS_PP": "WE HAVE RETURNED THE PACKAGE TO THE SENDER USING THE PACKAGE RETURN LABEL.",
  "UPS_RA": "THE FEDERAL COMMUNICATION COMMISSION REQUIRES ADDITIONAL INFORMATION BEFORE THE PACKAGE CAN BE RELEASED.",
  "UPS_RB": "YOUR PACKAGE IS AWAITING CLEARANCE RELATED TO THE TOXIC SUBSTANCE CONTROL ACT.",
  "UPS_RC": "YOUR PACKAGE IS AWAITING CLEARANCE RELATED TO DEPARTMENT OF TRANSPORTATION REQUIREMENTS.",
  "UPS_RD": "YOUR PACKAGE IS AWAITING CLEARANCE RELATED TO THE DEPARTMENT OF ALCOHOL, TOBACCO & FIREARMS REQUIREMENTS.",
  "UPS_RE": "YOUR PACKAGE IS BEING HELD BY THE CLEARING AGENCY FOR MARKING-REGULATIONS VERIFICATION.",
  "UPS_RF": "SATURDAY DELIVERY HAS BEEN REQUESTED.",
  "UPS_RG": "THE OPERATING FACILITY ACCEPTED THE REQUEST.",
  "UPS_RH": "THE OPERATING FACILITY WAS NOT ABLE TO MEET THE REQUEST.",
  "UPS_RI": "YOUR PACKAGE CONTAINS AN FDA-RESTRICTED COMMODITY. WE'RE UNABLE TO OBTAIN CLEARANCE.",
  "UPS_RJ": "YOUR PACKAGE IS BEING HELD TO PREPARE BOND PAPERWORK FOR ALTERNATE SITE CLEARANCE BY A NON-UPS BROKER.",
  "UPS_RM": "A GOVERNMENT AGENCY HAS PLACED A HOLD ON YOUR PACKAGE.",
  "UPS_RO": "DELIVERY WILL BE RESCHEDULED FOR SATURDAY.",
  "UPS_RP": "YOUR PACKAGE HAS BEEN DELAYED BY CUSTOMS OR OTHER GOVERNMENT AGENCY.",
  "UPS_RR": "INVOICE AND RECEIVER FEDERAL TAX ID # REQUIRED FOR SUBMISSION TO  U.S. CUSTOMS",
  "UPS_RS": "MORE DETAILED COMMODITY INFORMATION & RECEIVER'S TAX ID REQUIRED FOR SUBMISSION TO CUSTOMS",
  "UPS_RU": "WE CURRENTLY HAVE THE PACKAGE. THE RECEIVER REQUESTED CLEARANCE BY A NON-UPS BROKER.",
  "UPS_RV": "WE WILL RETURN THE PACKAGE TO THE SENDER ON SATURDAY.",
  "UPS_RW": "WE WILL MAKE A SECOND DELIVERY ATTEMPT TODAY.",
  "UPS_RX": "CLEARANCE AND POWER OF ATTORNEY REQUIRED FOR SUBMISSION TO U.S. CUSTOMS",
  "UPS_RY": "A NON-UPS LABOR DISPUTE HAS DELAYED DELIVERY. WE'RE WORKING TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_RZ": "YOUR PACKAGE IS AWAITING RELEASE FROM THE CLEARING AGENCY FOR FORMAL ENTRY AT THE EXPORT LOCATION.",
  "UPS_R1": "DETAILED COMMODITY INFORMATION & ADHERENCE TO CUSTOMS COUNTRY OR ORIGIN MARKING REQUIREMENTS",
  "UPS_R4": "ADDITIONAL INFORMATION IS REQUIRED. YOUR PACKAGE IS PENDING RELEASE FROM A GOVERNMENT AGENCY OTHER THAN CUSTOMS.",
  "UPS_R5": "WE'VE SUBMITTED DOCUMENTATION TO A GOVERNMENT AGENCY AND ARE AWAITING A RESPONSE.",
  "UPS_R6": "POWER OF ATTORNEY & MORE DETAILED COMMODITY INFORMATION REQUIRED FOR SUBMISSION TO U.S. CUSTOMS",
  "UPS_R7": "POWER OF ATTORNEY & RECEIVER FEDERAL TAX ID # REQUIRED FOR SUBMISSION TO U.S. CUSTOMS",
  "UPS_SF": "THE CLEARING AGENCY IS EXPERIENCING TECHNICAL DIFFICULTIES AND IS TEMPORARILY UNABLE TO TRANSMIT PACKAGE INFORMATION.",
  "UPS_SH": "THIS PACKAGE HAS MORE THAN ONE RECEIVER AND REQUIRES SPECIAL HANDLING TO ENSURE PROPER DELIVERY.",
  "UPS_SI": "YOUR SHIPMENT WAS NOT PROCESSED BY UPS BROKERAGE. THIS HAS CAUSED A DELAY.",
  "UPS_SJ": "THIS RETURNED PACKAGE REQUIRES AN EXPORT INVOICE FOR DUTY RELIEF.",
  "UPS_SK": "YOUR SHIPMENT WAS NOT PROCESSED BY UPS BROKERAGE AND HAS NOT CLEARED CUSTOMS. THIS HAS CAUSED A DELAY.",
  "UPS_SL": "ADDITIONAL DOCUMENTS ARE REQUIRED FOR DUTY RELIEF.",
  "UPS_SM": "ORIGINAL GSP CERTIFICATE REQUIRED FOR DUTY RELIEF",
  "UPS_SN": "DOCUMENTATION FOR PERSONAL BELONGINGS IS MISSING AND IS REQUIRED FROM THE RECEIVER.",
  "UPS_SP": "TEMPORARY-IMPORT DETAILS ARE REQUIRED FROM THE RECEIVER.",
  "UPS_SR": "YOUR PACKAGE IS AT THE CLEARING AGENCY AWAITING FINAL RELEASE.",
  "UPS_SS": "YOUR PACKAGE MAY BE DELAYED DUE TO A REQUIRED DOCUMENT INSPECTION BY THE CLEARING AGENCY.",
  "UPS_SV": "AS REQUESTED, THE PACKAGE IS MOVING IN-BOND TO A NON-UPS OFF-SITE BROKER FOR CLEARANCE.",
  "UPS_SX": "YOUR PACKAGE IS IN TRANSIT. WE'RE UPDATING PLANS TO SCHEDULE YOUR DELIVERY.",
  "UPS_SY": "INSPECTION REQUESTED BY CUSTOMS OR UPS",
  "UPS_S1": "YOUR PACKAGE MAY BE DELAYED DUE TO ADDRESS VERIFICATION BY THE CLEARING AGENCY.",
  "UPS_S2": "THIS PACKAGE REQUIRES SPECIAL ENTRY. THE RECEIVER WILL BE REQUIRED TO PREPARE ADDITIONAL PAPERWORK AFTER CLEARANCE.",
  "UPS_S3": "THE PACKAGE HAS CLEARED CUSTOMS, HOWEVER, A CLEARANCE STICKER IS REQUIRED BY THE RECEIVER.",
  "UPS_S4": "THE PACKAGE WAS EXPORTED OUT OF A EUROPEAN UNION COUNTRY, BUT NOT IN FREE CIRCULATION. CUSTOMS CLEARANCE IS REQUIRED.",
  "UPS_S5": "WE'RE WORKING TO RESOLVE TECHNICAL ISSUES TEMPORARILY PREVENTING US FROM TRANSMITTING INFORMATION TO THE CLEARING AGENCY",
  "UPS_S6": "THE RECEIVER WILL ONLY ACCEPT DELIVERY DURING CERTAIN HOURS. WE'RE ADJUSTING DELIVERY PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_S7": "THE RECEIVER REQUESTED THIS PACKAGE TO BE HELD FOR PICKUP AT THE UPS FACILITY.",
  "UPS_S8": "A LATE UPS TRAILER ARRIVAL HAS CAUSED A DELAY. WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_S9": "WE'VE SENT THE PACKAGE TO UPS LOST AND FOUND.",
  "UPS_TA": "WE'VE CONTACTED THE SENDER.",
  "UPS_TB": "THE RECEIVER REQUESTED A TEMPORARY CHANGE TO THE DELIVERY ADDRESS.",
  "UPS_TC": "C.O.D. INFORMATION NEEDS TO BE VALIDATED BY SENDER TO COMPLETE DELIVERY",
  "UPS_TD": "UNABLE TO CONTACT CUSTOMER-UPS SENT A NEXT DAY LETTER TO THE RECEIVER",
  "UPS_TE": "AS REQUESTED, THE PACKAGE IS MOVING IN-BOND TO AN ALTERNATE LOCATION FOR REGULATORY CLEARANCE.",
  "UPS_TF": "WE REQUIRE A PHONE NUMBER FOR THE DELIVERY ADDRESS.",
  "UPS_TG": "A SAMPLE OF THE SHIPMENT WAS TAKEN BY CLEARING AGENCY",
  "UPS_TH": "YOUR DELIVERY HAS BEEN RESCHEDULED FOR THE NEXT BUSINESS DAY.",
  "UPS_TI": "SERVICE DISRUPTION OCCURRED",
  "UPS_TJ": "WE SENT THE PACKAGE TO UPS LOST AND FOUND.",
  "UPS_TK": "WE WILL CONTACT THE SENDER.",
  "UPS_TN": "WE'RE UNABLE TO DELIVER YOUR PACKAGE.",
  "UPS_TO": "SAME DAY WILL CALL FOR COURIER PICK UP",
  "UPS_TP": "SHIPMENT DESTROYED BY CLEARING AGENT",
  "UPS_TS": "THE RETURN LABEL WAS DISCARDED.",
  "UPS_TT": "PACKAGE RESUBMITTED TO CLEARING AGENCY FOR CLEARANCE",
  "UPS_TU": "ADDRESS INFORMATION IS MISSING. THE PACKAGE WAS RETURNED TO THE SENDER.",
  "UPS_T3": "THE SENDER REQUESTED THAT WE HOLD THIS PACKAGE.",
  "UPS_T4": "THE SENDER REQUESTED A CHANGE TO THE SERVICE FEATURES.",
  "UPS_T5": "THE CUSTOMER HAS REQUESTED A CHANGE TO THE C.O.D AMOUNT",
  "UPS_T6": "THE CUSTOMER HAS REQUESTED THAT A SIGNATURE NO LONGER BE REQUIRED FOR THE DELIVERY OF THIS PACKAGE",
  "UPS_T7": "YOUR PACKAGE HAS BEEN PLACED IN A CLIMATE CONTROLLED ENVIRONMENT.",
  "UPS_T8": "YOUR PACKAGE HAS BEEN REMOVED FROM A CLIMATE CONTROLLED ENVIRONMENT.",
  "UPS_T9": "THE RECEIVER REQUESTED A CUSTOMS BROKER OTHER THAN UPS.",
  "UPS_UE": "A SPECIAL ACCOUNT PACKAGE IS BEING HELD AT THE UPS FACILITY FOR PICKUP. THE PICKUP MUST BE MADE WITHIN 5 BUSINESS DAYS.",
  "UPS_UG": "THE PACKAGE IS BEING HELD FOR A FUTURE DELIVERY DATE. WE'LL ATTEMPT TO DELIVER ON THE DATE REQUESTED.",
  "UPS_UM": "WE'RE INVESTIGATING THE DAMAGE CLAIM.",
  "UPS_UN": "THE PACKAGE CONTAINS AN UNAUTHORIZED TOBACCO COMMODITY, AND WE ARE UNABLE TO COMPLETE THE DELIVERY.",
  "UPS_UO": "LOST PACKAGE INVESTIGATION",
  "UPS_UP": "WE'RE ATTEMPTING TO VERIFY THE PACKAGE LOCATION.",
  "UPS_UW": "UNPAID COD INVESTIGATION",
  "UPS_UX": "INVESTIGATION ONLY",
  "UPS_UY": "DAMAGE TO PACKAGE CONTENTS WAS REPORTED. WE WILL NOTIFY THE SENDER.",
  "UPS_UZ": "SAME DAY WILL CALL FOR COURIER PICK UP",
  "UPS_VA": "THE RECEIVER CANCELED THE WILL CALL AND WE WILL ATTEMPT DELIVERY.",
  "UPS_VB": "WILL-CALL PICKUP MUST BE MADE WITHIN 5 BUSINESS DAYS.",
  "UPS_VD": "UPS WILL REDELIVER TO SAME ADDRESS ON DAY AFTER SAME DAY WILL CALL REQUEST",
  "UPS_VE": "THE RECEIVER AGREED TO PICK UP THE PACKAGE THIS EVENING.",
  "UPS_VG": "WE'LL ATTEMPT TO REDELIVER TODAY.",
  "UPS_VH": "WE'VE CONFIRMED ARRANGEMENTS.",
  "UPS_VI": "UNABLE TO CONTACT CUSTOMER AT PRIMARY NUMBER",
  "UPS_VJ": "UNABLE TO CONTACT CUSTOMER AT ALTERNATE NUMBER",
  "UPS_VK": "THE PACKAGE IS AWAITING CLEARING AGENCY REVIEW.",
  "UPS_VL": "THE BUSINESS IS CLOSED FOR THE WEEKEND. THERE'S A MIDDLE EAST WEEKEND DELIVERY DELAY DUE TO DIFFERENT WORK PRACTICES.",
  "UPS_VM": "AS REQUESTED, THE DELIVERY CHANGE WAS COMPLETED.",
  "UPS_VN": "THE RECEIVER ARRANGED FOR SAME-DAY PICKUP AT A UPS FACILITY.",
  "UPS_VQ": "MRN (MOVEMENT REFERENCE NUMBER) PROVIDED BY CUSTOMER DUE TO HIGH CUSTOMS VALUE OF SHIPMENT",
  "UPS_VR": "MRN (MOVEMENT REFERENCE NUMBER) PROVIDED BY UPS DUE TO HIGH CUSTOMS VALUE OF SHIPMENT",
  "UPS_W8": "AS REQUESTED, THE PACKAGE IS NOW IN TRANSIT TO A FREE TRADE ZONE.",
  "UPS_XB": "YOUR PACKAGE IS DELAYED DUE TO SIMPLIFIED/CONSOLIDATED ENTRY. ADDITIONAL IMPORT INFORMATION OR DOCUMENTS ARE REQUIRED.",
  "UPS_XC": "DUE TO COMMODITY OR WEIGHT, YOUR PACKAGE IS BEING HELD TO VERIFY VALUE.",
  "UPS_XE": "ORIGINAL DOCUMENTS REQUIRED (IMMIGRATION DOCUMENTS, VISA, ETC)",
  "UPS_XG": "INCORRECT CURRENCY CODE ON THE INVOICE",
  "UPS_XJ": "THE CLEARING AGENCY IS CLOSED. WE WILL SUBMIT THE PACKAGE FOR CLEARANCE ONCE THEIR OFFICE REOPENS.",
  "UPS_XK": "SHIPMENT REQUIRES INSPECTION BY BOTH FISH & WILDLIFE AND AGRICULTURE PPQ BEFORE SUBMISSION TO CUSTOMS",
  "UPS_XL": "SHIPMENT REQUIRES INSPECTION BY BOTH FISH & WILDLIFE AND FOOD AND DRUG ADMINISTRATION BEFORE SUBMISSION TO CUSTOMS",
  "UPS_XN": "WE MUST CONTACT THE RECEIVER FOR IMPORT REQUIREMENTS TO CLEAR THE PACKAGE, BUT THE RECEIVER'S PHONE # IS INVALID.",
  "UPS_XO": "INVOICE DOCUMENTATION INFORMATION WAS DISPUTED AT IMPORT AND MUST BE VALIDATED BY THE SENDER.",
  "UPS_XQ": "SHIPPER, MANUFACTURER AND/OR REGISTRATION #'S REQUIRED BY BIOTERRORISM ACT (BTA) FOR PRIOR NOTICE (PN) IS/ARE MISSING",
  "UPS_XS": "SHIPPER, MANUFACTURER AND/OR REGISTRATION #'S MISSING FOR PN PER BIOTERRORISM ACT (BTA) & HELD FOR AGRICULTURE INSPECT",
  "UPS_XU": "SHIPPER, MANUFACTURER AND/OR REGISTRATION NUMBERS MISSING FOR PN PER BIOTERRORISM ACT (BTA) & MISSING THE INVOICE",
  "UPS_XV": "THE SHIPMENT IS BEING HELD. COMMODITY DESCRIPTION INFORMATION MUST BE VALIDATED BY THE SENDER.",
  "UPS_XW": "THE SENDER MUST PROVIDE A UNIQUE CUSTOMS IDENTIFICATION NUMBER SO THAT THE PACKAGE CAN BE CLEARED.",
  "UPS_XY": "YOUR PACKAGE IS DELAYED AT EXPORT AND IS AWAITING RELEASE FROM CUSTOMS.",
  "UPS_XZ": "YOUR PACKAGE WAS CLEARED AFTER THE SCHEDULED TRANSPORT DEPARTURE. WE WILL RESCHEDULE FOR THE NEXT AVAILABLE DEPARTURE.",
  "UPS_X2": "YOUR PACKAGE IS AWAITING RELEASE FROM THE CLEARING AGENCY FOR FORMAL ENTRY AT THE IMPORT LOCATION.",
  "UPS_X3": "YOUR PACKAGE HAS BEEN DELAYED BY A CLEARING AGENCY HOLD.",
  "UPS_X4": "YOUR PACKAGE HAS BEEN DELAYED DUE TO INCORRECT TARIFF CLASSIFICATION WHICH MUST BE RESUBMITTED TO THE CLEARING AGENCY.",
  "UPS_X5": "CLEARING AGENCY REQUIRES AUTHORIZATION FROM THE TRADEMARK HOLDER PRIOR TO IMPORT AND RELEASE. WE'LL CONTACT THE SENDER.",
  "UPS_X6": "IMMIGRATION DOCUMENTS REQUIRED BY CUSTOMS PRIOR TO RELEASE OF SHIPMENT",
  "UPS_X7": "CUSTOMS REQUIRES THAT MULTIPLE PACKAGES SHIPPING ON THE SAME DAY TO THE SAME IMPORTER BE COMBINED INTO ONE SHIPMENT.",
  "UPS_X8": "THE COUNTRY OF ORIGIN IS MISSING AND IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_X9": "AS REQUESTED BY THE RECEIVER, WE'LL HOLD THE PACKAGE, AND CONTACT THEM FOR INSTRUCTION BEFORE SUBMITTING FOR CLEARANCE.",
  "UPS_YA": "AS REQUESTED, WE HAVE GIVEN DOCUMENTATION TO AN ALTERNATE BROKER AND ARE AWAITING CLEARANCE.",
  "UPS_YD": "THE POST OFFICE ATTEMPTED TO DELIVER YOUR UPS SUREPOST PACKAGE AND LEFT A DELIVERY NOTICE WITH INSTRUCTIONS.",
  "UPS_YE": "THE POST OFFICE ATTEMPTED TO DELIVER THE UPS SUREPOST PACKAGE, BUT THE RECEIVER REFUSED DELIVERY.",
  "UPS_YF": "THE POST OFFICE WAS UNABLE TO DELIVER THE UPS SUREPOST PACKAGE AS ADDRESSED. PLEASE CONTACT THE SENDER FOR ASSISTANCE.",
  "UPS_YG": "THE POST OFFICE FORWARDED THE UPS SUREPOST PACKAGE TO THE RECEIVER'S ADDRESS ON FILE.",
  "UPS_YI": "YOUR UPS SUREPOST PACKAGE WAS TRANSFERRED TO THE WRONG POST OFFICE. IT IS BEING CORRECTED.",
  "UPS_YJ": "THE POST OFFICE WAS UNABLE TO DELIVER THE UPS SUREPOST PACKAGE AS ADDRESSED AND RETURNED IT TO THE SENDER.",
  "UPS_YK": "THE POST OFFICE WAS UNABLE TO DELIVER THE UPS SUREPOST PACKAGE AND RETURNED IT TO THE SENDER.",
  "UPS_YL": "THE POST OFFICE WAS UNABLE TO DELIVER YOUR UPS SUREPOST PACKAGE.  IT IS BEING SENT TO THE POSTAL DISPOSAL SITE.",
  "UPS_YM": "THE POST OFFICE WAS UNABLE TO DELIVER YOUR UPS SUREPOST PACKAGE. IT IS BEING SENT TO THE POSTAL RECOVERY SITE.",
  "UPS_YR": "YOUR PACKAGE IS AT THE UPS DISTRIBUTION FACILITY AND IS SCHEDULED FOR DELIVERY ON THE NEXT BUSINESS DAY.",
  "UPS_YS": "AS REQUESTED BY THE SENDER, THIS PACKAGE REQUIRES SPECIAL HANDLING.",
  "UPS_YT": "THE UPS RETURNS? PACK AND COLLECT BOX REQUESTED BY THE SENDER IS NOT AN APPROPRIATE MATCH FOR THE GOODS TO BE RETURNED.",
  "UPS_YU": "THE CONTENTS OF THE PACKAGE BEING RETURNED DO NOT MATCH THE DESCRIPTION PROVIDED BY THE SENDER.",
  "UPS_YV": "THE RETURN LABEL WAS MISSING. WE'RE UNABLE TO RETURN THE PACKAGE TO THE SENDER.",
  "UPS_YW": "A UPS RETURNS PACK AND COLLECT BOX WAS NOT REQUESTED BY THE SENDER. THE GOODS CANNOT BE PICKED UP.",
  "UPS_YX": "THE SENDER MUST REQUEST ANOTHER PICKUP AND MUST ENSURE THAT THE APPROPRIATE PACK AND COLLECT BOX TYPE IS SELECTED.",
  "UPS_Y1": "THE PACKAGE IS AT THE CLEARING AGENCY AWAITING FINAL RELEASE.",
  "UPS_Y2": "WE'VE REQUESTED THAT THE RECEIVER CONTACT US.",
  "UPS_Y3": "WE'VE CONTACTED THE RECEIVER.",
  "UPS_Y4": "SHIPMENT TRANSFERRED TO LOCAL GOVT AGENCY AND IS TEMPORARILY OUT OF UPS CONTROL",
  "UPS_Y5": "DOCUMENTS OR INFO REQUESTED FROM THE CUSTOMER WERE RECEIVED AND ARE BEING PROCESSED FOR CLEARANCE",
  "UPS_Y6": "AUTHORIZATION RECEIVED FROM THE CUSTOMER",
  "UPS_Y7": "THE PACKAGE IS BEING HELD FOR A FUTURE DELIVERY DATE.",
  "UPS_Y9": "THE PACKAGE IS SCHEDULED FOR TRANSFER TO THE POST OFFICE BY THE NEXT BUSINESS DAY. ALLOW AT LEAST TWO DAYS FOR DELIVERY.",
  "UPS_ZA": "A UPS MY CHOICE DELIVERY CHANGE WAS REQUESTED FOR THIS PACKAGE.",
  "UPS_ZB": "AT THE RECEIVER'S REQUEST, THE UPS MY CHOICE DELIVERY CHANGE OPTION WAS MODIFIED.",
  "UPS_ZC": "AS REQUESTED, THE UPS MY CHOICE DELIVERY CHANGE WAS COMPLETED.",
  "UPS_ZD": "DELIVER TO A UPS ACCESS POINT.",
  "UPS_ZL": "DELIVERY TO UPS ACCESS POINT PENDING.",
  "UPS_ZM": "THE POST OFFICE ATTEMPTED DELIVERY OF YOUR UPS SUREPOST PACKAGE, BUT THE RECEIVING BUSINESS WAS CLOSED.",
  "UPS_ZN": "PACKAGE HAS BEEN DISPATCHED FROM THE USPS INTERNATIONAL SERVICE CENTER FOR FINAL DELIVERY TO RECEIVER.",
  "UPS_ZO": "THE UPS ACCESS POINT HAS PREPARED THE PACKAGE FOR RETURN TO UPS.",
  "UPS_ZP": "DELIVERED TO UPS ACCESS POINT; AWAITING CUSTOMER PICKUP.",
  "UPS_Z1": "BROKERAGE RELEASED THE PACKAGE. IT WILL BE PROCESSED THROUGH A CLEARING AGENCY BEFORE FINAL RELEASE TO UPS.",
  "UPS_Z3": "RECEIVER'S CUSTOMS BROKER HAS BEEN ASSIGNED. THE SHIPMENT IS NOW RELEASED TO MOVE IN TRANSIT",
  "UPS_Z5": "TEMPORARY BOND IS RELEASED BY CUSTOMS, THE CONSIGNEE MAY NOT OPEN THE SHIPMENT UNTIL THE FOLLOWING BUSINESS DAY AT NOON",
  "UPS_01": "THE PACKAGE WAS MISSED AT THE DESTINATION LOCATION",
  "UPS_02": "DELIVERY WILL BE RESCHEDULED.",
  "UPS_03": "WE'VE MISSED THE SCHEDULED TRANSFER TIME. THIS MAY CAUSE A DELAY.",
  "UPS_04": "A UPS PROCESSING ERROR HAS DELAYED DELIVERY. WE'RE ADJUSTING PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_05": "A REQUIRED REGULATORY INSPECTION HAS DELAYED DELIVERY. WE'RE WORKING TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_06": "WE'VE MISROUTED THE PACKAGE. THIS MAY CAUSE A DELAY.",
  "UPS_07": "WE'VE MISROUTED THE PACKAGE. THIS MAY CAUSE A DELAY.",
  "UPS_08": "WE'VE HELD THE PACKAGE AT THIS FACILITY. THIS MAY CAUSE A DELAY.",
  "UPS_11": "THE PACKAGE DID NOT ARRIVE AT THE DESTINATION.",
  "UPS_14": "THE SERVICE HAS BEEN CHANGED AND THE DELIVERY IS BEING RESCHEDULED.",
  "UPS_15": "A TRAIN DERAILMENT HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_16": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_17": "A LATE UPS TRAILER ARRIVAL HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_18": "A LATE FLIGHT HAS CAUSED A DELAY. WE'RE ADJUSTING PLANS AND WORKING TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_19": "A LATE UPS TRAILER ARRIVAL HAS CAUSED A DELAY. WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_2A": "RECENT WEATHER HAS CAUSED DELIVERY DELAYS.  RECOVERY EFFORTS ARE UNDER WAY TO DELIVER YOUR PACKAGE AS SOON AS POSSIBLE.",
  "UPS_2B": "THE MILITARY PACKAGE IS BEING HELD FOR DUTY FREE CLEARANCE PENDING PAPERWORK.",
  "UPS_2R": "THE POST OFFICE WAS UNABLE TO DELIVER YOUR UPS SUREPOST PACKAGE AND RETURNED IT TO UPS. WE WILL RETURN TO THE SENDER.",
  "UPS_2S": "UPS WILL ATTEMPT TO DELIVER.",
  "UPS_2U": "WE'LL BE IN YOUR AREA AND WILL DELIVER YOUR UPS SUREPOST PACKAGE INSTEAD OF THE POST OFFICE.",
  "UPS_2V": "YOUR PACKAGE WAS SENT BACK TO THE POST OFFICE FOR DELIVERY.",
  "UPS_2X": "CUSTOMER WAS NOT AVAILABLE ON 1ST ATTEMPT. DELIVERY WILL BE MADE TO A NEARBY UPS ACCESS POINT FOR CUSTOMER TO PICK UP.",
  "UPS_2Y": "WE HAVE NOT YET UNLOADED THE PACKAGE FROM THE TRAILER. THIS MAY DELAY DELIVERY.",
  "UPS_2Z": "WE WERE UNABLE TO DISPATCH THE TRAILER ON TIME. THIS MAY CAUSE A DELAY.",
  "UPS_22": "WE WERE UNABLE TO DISPATCH THE TRAILER ON TIME. THIS MAY CAUSE A DELAY.",
  "UPS_23": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_3A": "WE'VE LEFT THE PACKAGE IN OUR FACILITY. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_3B": "WE HAVE NOT YET UNLOADED THE PACKAGE FROM THE TRAILER.",
  "UPS_3C": "A UPS FACILITY OUTAGE HAS DELAYED DELIVERY. WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_3J": "UPS ACCESS POINT CLOSED, PACKAGE NOT DELIVERED. ANOTHER ATTEMPT WILL BE MADE TO A UPS ACCESS POINT",
  "UPS_3L": "UPS ACCESS POINT UNABLE TO ACCEPT PACKAGE. ANOTHER ATTEMPT WILL BE MADE TO A UPS ACCESS POINT.",
  "UPS_3N": "THE PACKAGE WAS NOT PICKED UP BY THE RECEIVER AT THE UPS ACCESS POINT AND WILL BE RETURNED TO SENDER.",
  "UPS_3P": "PACKAGE HAS BEEN RECEIVED FROM UPS ACCESS POINT. UPS WILL PROCESS AS NECESSARY.",
  "UPS_3Q": "THE PACKAGE UPGRADE HAS BEEN PROCESSED.",
  "UPS_3R": "UPGRADE COMPLETED; DELIVER TO ANOTHER ADDRESS",
  "UPS_3S": "AS REQUESTED, PACKAGE WAS UPGRADED AND HOLD-FOR-PICKUP WILL BE PROCESSED. PACKAGE NOT YET AVAILABLE FOR PICKUP.",
  "UPS_3U": "UPGRADE COMPLETED; RESCHEDULED DELIVERY",
  "UPS_3V": "UPGRADE COMPLETED; DELIVER TO UPS ACCESS POINT",
  "UPS_3W": "THE REQUEST FOR A SERVICE UPGRADE THROUGH UPS MY CHOICE WAS NOT COMPLETED.",
  "UPS_30": "THE REQUEST FOR THIS PACKAGE WAS CANCELLED",
  "UPS_31": "WE'VE LEFT THE PACKAGE IN OUR FACILITY. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_33": "THE BILLING OPTION SELECTED IS NOT VALID FOR THIS PACKAGE.",
  "UPS_34": "WE'VE INCORRECTLY SORTED THE PACKAGE AT OUR FACILITY. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_39": "THE SENDER REQUESTED THIS PACKAGE BE HELD FOR PICKUP AT A UPS FACILITY.",
  "UPS_4G": "WE WERE REQUIRED TO WAIT IN ORDER TO COMPLETE THE PICKUP.",
  "UPS_4H": "WE WERE REQUIRED TO USE THE LIFT GATE IN ORDER TO COMPLETE THE PICKUP.",
  "UPS_4I": "THE PACKAGE IS IN STORAGE.",
  "UPS_4J": "SHIPMENT REMOVED FROM STORAGE",
  "UPS_4K": "WE WERE REQUIRED TO WAIT IN ORDER TO COMPLETE THE DELIVERY.",
  "UPS_4L": "WE WERE REQUIRED TO USE THE LIFT GATE IN ORDER TO COMPLETE THE DELIVERY.",
  "UPS_4M": "WORLDWIDE EXPRESS FREIGHT - CUSTOMER HAS REQUESTED RE-DELIVERY ATTEMPT",
  "UPS_4N": "UPGRADE WILL NOT BE PROCESSED, NOR ANY UPS MY CHOICE DELIVERY CHANGE, IF REQUESTED",
  "UPS_4P": "THE PACKAGE IS EITHER OVERWEIGHT OR OVERSIZED. WE REQUIRE PRE-AUTHORIZATION FOR DELIVERY.",
  "UPS_4Q": "REQUIRES APPROVAL",
  "UPS_4R": "THE PACKAGE IS BEING RETURNED TO THE SENDER OR RE-DELIVERED BY A FREIGHT FORWARDING SERVICE.",
  "UPS_4S": "THE PACKAGE WAS RETURNED TO THE SENDER VIA FREIGHT FORWARDING.",
  "UPS_4T": "APPROVED FOR TRANSIT",
  "UPS_4Y": "YOUR SHIPMENT IS SCHEDULED TO ARRIVE TODAY AFTER THE DELIVERY COMMITMENT TIME",
  "UPS_4Z": "THE ADDRESS LABEL BECAME DETACHED FROM THE PACKAGE. THE SENDER WILL BE NOTIFIED.",
  "UPS_46": "THE SERVICE SELECTED IS NOT AVAILABLE TO THIS DESTINATION ADDRESS. THIS HAS DELAYED DELIVERY.",
  "UPS_47": "WE DO NOT CURRENTLY SERVE THE DESTINATION ADDRESS FOR THIS PACKAGE.",
  "UPS_48": "THE RECEIVER WAS NOT AVAILABLE AT THE TIME OF THE FIRST DELIVERY ATTEMPT. A SECOND ATTEMPT WILL BE MADE.",
  "UPS_49": "THE RECEIVER WAS NOT AVAILABLE AT THE TIME OF THE FINAL DELIVERY ATTEMPT.",
  "UPS_5D": "THE CUSTOMER CANCELLED THE PACKAGE DROPOFF; UPS DOES NOT HAVE THIS PACKAGE",
  "UPS_5G": "THE PACKAGE REMAINS AT THE UPS ACCESS POINT AND IS REACHING THE AGED DATE",
  "UPS_5R": "CUSTOMER WAS NOT AVAILABLE WHEN UPS ATTEMPTED DELIVERY. WILL DELIVER TO A NEARBY UPS ACCESS POINT FOR CUSTOMER PICKUP.",
  "UPS_5S": "REROUTE TO AN ALTERNATE UPS ACCESS POINT FOR DELIVERY AND CUSTOMER PICKUP",
  "UPS_5T": "PACKAGE HELD; UPS WILL CONTACT CUSTOMER FOR FURTHER INSTRUCTIONS",
  "UPS_5U": "THE ORIGINAL UPS ACCESS POINT IS NOT AVAILABLE FOR DELIVERY. WE'LL CONTACT RECEIVER FOR AN ALTERNATE DELIVERY LOCATION.",
  "UPS_5V": "DELIVERY COULD NOT BE MADE TO THE ORIGINAL UPS ACCESS POINT. PKG WILL BE DELIVERED TO ANOTHER NEARBY UPS ACCESS POINT.",
  "UPS_5W": "THE ORIGINAL UPS ACCESS POINT IS NOT AVAILABLE. DELIVERY TO AN ALTERNATE UPS ACCESS POINT PENDING.",
  "UPS_5Z": "DELIVERY TO UPS ACCESS POINT UNSUCCESSFUL; A SECOND ATTEMPT AT THE RECEIVER'S ADDRESS WILL BE MADE",
  "UPS_51": "THE DRIVER WAS UNABLE TO COLLECT FUNDS ON THE FIRST DELIVERY ATTEMPT. A SECOND ATTEMPT WILL BE MADE.",
  "UPS_52": "THE DRIVER WAS UNABLE TO COLLECT FUNDS ON THE FINAL DELIVERY ATTEMPT.",
  "UPS_54": "THE RECEIVER ARRANGED TO PICK UP THE PACKAGE AT A UPS FACILITY. PICKUP MUST BE MADE WITHIN 5 BUSINESS DAYS.",
  "UPS_55": "THE RECEIVING BUSINESS WAS CLOSED.",
  "UPS_56": "THIS DELIVERY WAS MADE AFTER THE UPS SERVICE COMMITMENT TIME OF NOON",
  "UPS_59": "THIS DELIVERY WAS MADE AFTER THE UPS SERVICE COMMITMENT TIME OF 10:30 A.M",
  "UPS_6B": "PACKAGES ARE READY FOR PICKUP DUE TO UPS ACCESS POINT CLOSING. CUSTOMER WILL BE CONTACTED FOR NEXT STEPS.",
  "UPS_6C": "PACKAGES ARE READY FOR UPS PICKUP AND WILL BE RETURNED DUE TO AGING.",
  "UPS_6D": "WE'RE WORKING TO DELIVER YOUR PACKAGE AS SOON AS POSSIBLE.",
  "UPS_6E": "YOUR PACKAGE WAS NOT RECEIVED AT THE UPS FACILITY AS ORIGINALLY SCHEDULED. THIS MAY CAUSE A DELAY.",
  "UPS_6G": "MODIFICATION OF THE RECEIVER'S ADDRESS",
  "UPS_6H": "AS REQUESTED, UPS MY CHOICE PACKAGE WILL BE DELIVERED TO CUSTOMER'S PREFERRED UPS ACCESS POINT",
  "UPS_6I": "AS REQUESTED, PACKAGE WILL BE RETRIEVED FROM UPS ACCESS POINT AND RE-DELIVERED TO ORIGINAL ADDRESS",
  "UPS_6J": "DELIVERY TO A UPS ACCESS POINT LOCATION IS PENDING.",
  "UPS_6K": "PACKAGE WILL BE DELIVERED TO THE UPS ACCESS POINT ON THE NEXT BUSINESS DAY",
  "UPS_6L": "PACKAGE NOT ELIGIBLE FOR UPS ACCESS POINT DELIVERY; WILL RE-ATTEMPT DELIVERY AT THE ORIGINAL ADDRESS",
  "UPS_6P": "PACKAGE IN TRANSIT AND SCHEDULED FOR UPS DELIVERY ATTEMPT TO RECIPIENT ON NEXT UPS BUSINESS DAY",
  "UPS_6R": "CUSTOMER NOT IN ON 1ST ATTEMPT. DELIVERY WILL BE MADE TO A UPS ACCESS POINT NEXT BUSINESS DAY FOR CUSTOMER PICKUP.",
  "UPS_6S": "THE PACKAGE EXCEEDS WEIGHT OR SIZE LIMIT FOR UPS ACCESS POINT LOCATIONS; DELIVER PACKAGE TO RECIPIENT",
  "UPS_6T": "THE C.O.D. EXCEEDS THE AMOUNT ALLOWED FOR UPS ACCESS POINT LOCATIONS. WE WILL CONTACT THE RECEIVER.",
  "UPS_6U": "THE SELECTED UPS ACCESS POINT DOES NOT ACCEPT C.O.D.'S. WE WILL REROUTE OR CONTACT THE RECEIVER.",
  "UPS_6W": "THE PACKAGE HAS REMAINED AT THE UPS ACCESS POINT LOCATION BEYOND THE MAXIMUM DAYS ALLOWED.",
  "UPS_6X": "WE WILL CONTACT THE SENDER FOR INSTRUCTIONS.",
  "UPS_6Z": "UPS MY CHOICE MEMBER'S CHOSEN UPS ACCESS POINT PREFERENCES ARE NOT AVAILABLE",
  "UPS_60": "YOUR PACKAGE CONTAINS HAZARDOUS MATERIALS. WE WILL NOT TRANSPORT THIS PACKAGE BY AIR.",
  "UPS_7C": "SUREPOST PACKAGE WAS UPGRADED AND SENT TO CUSTOMER'S UPS ACCESS POINT PREFERENCE",
  "UPS_7D": "SUREPOST PACKAGE WAS UPGRADED TO UPS GROUND; UPS WILL DELIVER PACKAGE TO UPS ACCESS POINT",
  "UPS_7E": "SUREPOST PACKAGE UPGRADED TO UPS GROUND, BUT PREFERRED UPS ACCESS POINT IS UNAVAILABLE; UPS WILL CONTACT CUSTOMER",
  "UPS_7F": "THE RECEIVER MUST PAY THE DUTIES OR TAXES DUE ON THE PACKAGE.",
  "UPS_7G": "DISRUPTION IN NETWORK - TRACTOR TRAILER",
  "UPS_7H": "THE PACKAGE IS MISSING DUTY INFORMATION AND WILL BE RETURNED TO EXPORT LOCATION.",
  "UPS_7I": "THE PACKAGE MISSED THE SCHEDULED RAIL CONNECTION.",
  "UPS_7J": "R2R PACKAGE REFUSED AT THE UPS ACCESS POINT - HOLD PACKAGE AND CONTACT SHIPPER",
  "UPS_7L": "RECEIVER NOT AVAILABLE. UPS ACCESS POINT SERVICE CANCELED. WILL MAKE 2ND DELIVERY ATTEMPT AT THE RECEIVER'S ADDRESS.",
  "UPS_7M": "YOUR PACKAGE IS BEING HELD TO PREPARE BOND PAPERWORK FOR ALTERNATE SITE CLEARANCE BY A UPS BROKER.",
  "UPS_7N": "AN OPERATIONAL ERROR MAY DELAY DELIVERY. WE'RE WORKING TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_7P": "THE IMPORTER HAS NOT ASSIGNED A BROKER. THIS MAY DELAY DELIVERY.",
  "UPS_7Q": "THE RECEIVER HAS REQUESTED THAT WE MAKE AN APPOINTMENT FOR DELIVERY.",
  "UPS_7R": "UPS DELAYED THE PACKAGE DURING THE AVIATION SECURITY SCREENING",
  "UPS_7S": "A GOVERNMENT AGENCY DELAYED THE PACKAGE DURING THE AVIATION SECURITY SCREENING",
  "UPS_7T": "THE PACKAGE IS BEING HELD BECAUSE IT'S MISSING THE IPPC (INTERNATIONAL PLANT PROTECTION CONVENTION) STAMP.",
  "UPS_7U": "THE COMMODITY IS NOT IN THE IMPORTER'S DATABASE. UPS BROKERAGE WILL CONTACT THE IMPORTER.",
  "UPS_7V": "AN EMERGENCY SITUATION OR SEVERE WEATHER CONDITION HAS DELAYED DELIVERY.",
  "UPS_7W": "SEVERE WEATHER CONDITIONS HAVE DELAYED DELIVERY.",
  "UPS_7X": "RECENT WEATHER HAS CAUSED DELIVERY DELAYS.  RECOVERY EFFORTS ARE UNDER WAY TO DELIVER YOUR PACKAGE AS SOON AS POSSIBLE.",
  "UPS_7Y": "WE'VE LEFT THE PACKAGE IN OUR FACILITY. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_7Z": "DELIVERY WILL BE DELAYED BY ONE BUSINESS DAY.",
  "UPS_71": "EXPORT DOCUMENTATION IS INCOMPLETE OR MISSING. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_72": "THE PACKAGE WILL BE HELD UNTIL ALL PACKAGES ASSOCIATED WITH THIS SHIPMENT HAVE ARRIVED.",
  "UPS_73": "THE PACKAGE CONTAINS ARTICLES THAT UPS PROHIBITS FOR INTERNATIONAL SHIPPING.",
  "UPS_76": "SCHEDULED FOR DELIVERY TODAY",
  "UPS_77": "THE PACKAGE WILL BE FORWARDED TO A UPS FACILITY IN THE DESTINATION CITY.",
  "UPS_78": "THE SENDER REQUESTED A DELIVERY CHANGE FOR THIS PACKAGE.",
  "UPS_79": "WE UPDATED THE DELIVERY INFORMATION FOR YOUR PACKAGE.",
  "UPS_8A": "SENDER TENDERED THE SHIPMENT TO UPS AFTER THE LATEST PICKUP TIME FOR THE REQUESTED SERVICE. A DAY DELAY IS LIKELY.",
  "UPS_8C": "AFTER FURTHER REVIEW, YOUR PACKAGE MAY NOT HAVE ARRIVED ON-SCHEDULE. VISIT UPS.COM/TARIFF FOR TERMS AND CONDITIONS.",
  "UPS_8D": "THE PACKAGE WAS ABANDONED BY THE CUSTOMER AND WILL BE SURRENDERED TO CUSTOMS.",
  "UPS_8E": "AFTER FURTHER REVIEW, YOUR PACKAGE MAY NOT HAVE ARRIVED ON-SCHEDULE. VISIT UPS.COM/TARIFF FOR TERMS AND CONDITIONS.",
  "UPS_8F": "AFTER FURTHER REVIEW, YOUR PACKAGE MAY NOT HAVE ARRIVED ON-SCHEDULE. VISIT UPS.COM/TARIFF FOR TERMS AND CONDITIONS.",
  "UPS_8G": "THE UPS SUREPOST PACKAGE WAS MISROUTED. IT IS CURRENTLY BEING TRANSFERRED TO THE CORRECT USPS OFFICE FOR FINAL DELIVERY.",
  "UPS_84": "THE FREIGHT SHIPMENT IS OUT FOR DELIVERY",
  "UPS_87": "THE FREIGHT SHIPMENT IS DELAYED",
  "UPS_90": "THERE IS AN EMBARGO ON THE DESTINATION COUNTRY, AND THE PACKAGE WILL BE RETURNED TO THE SENDER.",
  "UPS_91": "THE C.O.D. TAG IS EITHER ILLEGIBLE OR INVALID.",
  "UPS_92": "THE RECEIVER HAS AGREED TO ACCEPT THE DELIVERY CHARGES",
  "UPS_93": "PACKAGE COULD NOT BE LOCATED FOR INTERCEPT",
  "UPS_95": "OUR DRIVER REQUIRES SECURITY ACCESS FOR THIS DELIVERY. WE ARE ATTEMPTING TO OBTAIN THE ACCESS INFORMATION.",
  "UPS_99": "PLEASE CONTACT UPS FOR ADDITIONAL INFORMATION.",
  "UPS_MP": "Order Processed Ready for UPS",
  "UPS_XD": "The shipment has been dropped off and is now at a UPS Access Point.",
  "UPS_2Q": "Delivered to UPS Access Point.",
  "UPS_KB": "Delivered",
  "UPS_2W": "Package picked up at UPS Access Point.",
  "UPS_FS": "Delivered",
  "UPS_AR": "Arrival Scan",
  "UPS_AT": "Air Transit Scan",
  "UPS_BY": "Bypass ULO",
  "UPS_CA": "Cancelled Arrival",
  "UPS_CD": "Cancelled Departure",
  "UPS_CK": "Cancel Link",
  "UPS_CL": "Cancel Unload",
  "UPS_DL": "Driver Load",
  "UPS_DP": "Departure Scan",
  "UPS_DS": "Destination Scan",
  "UPS_EP": "Export Scan",
  "UPS_HU": "Hub Scan",
  "UPS_IP": "Import Scan",
  "UPS_IT": "In Transit",
  "UPS_LC": "Location Scan",
  "UPS_LD": "Load",
  "UPS_LK": "Link ULO To ULO",
  "UPS_OF": "Out For Delivery",
  "UPS_OR": "Origin Scan",
  "UPS_PU": "Pickup Scan",
  "UPS_RK": "Remove ULO from ULO",
  "UPS_TR": "Transfer ULO to ULO",
  "UPS_UA": "Updated Arrival",
  "UPS_UD": "Updated Departure",
  "UPS_UF": "ULO Load Key from",
  "UPS_UL": "Unload Scan",
  "UPS_UT": "ULO Load Key to",
  "UPS_VF": "ULO Diversion from",
  "UPS_VT": "ULO Diversion to",
  "UPS_WH": "Warehouse Scan",
  "UPS_XA": "At Local Post Office",
  "UPS_XR": "Received by the local post office",
  "UPS_YH": "Received by the local post office",
  "UPS_UI": "Agent pickup; in transit to UPS facility.",
  "UPS_VP": "Void Pickup",
  "UPS_TL": "Transit Scan",
  "UPS_SD": "Delivery Attempt in Progress",
  "UPS_LM": "Location Scan",
  "UPS_OC": "Origin Scan",
  "UPS_OT": "Out For Delivery Today",
  "UPS_AG": "Package is in transit to a UPS facility",
  "U": "U",
  "ESENDEO_STOCK": "ESENDEO_STOCK",
  "EXPCFM": "package is in transit",
  "AARCFM": "Parcel is being processed at Colicoli hub",
  "SOLREC": "Parcel could not be delivered and returned to Colicoli hub - First delivery attempt failed",
  "SOLMLV": "Parcel could not be delivered and returned to Colicoli hub - Parcel couldn't be delivered. It'll be delivered the next working day.",
  "SOLRED": "Parcel could not be delivered and returned to Colicoli hub - Parcel has been returned to sender",
  "DCHRCA": "Your parcel has been returned to the sender following an incident.",
  "RSTPRO": "The contents of your package are prohibited and it cannot be delivered to its recipient.",
  "CHGCFM": "Your parcel has arrived in France.",
  "RENDDC": "Parcel destroyed at the customer's request",
  "AARDVY": "Your parcel has arrived in error at a site. It is currently being rerouted to its delivery location",
  "RENEFM": "Not delivered - Force majeure",
  "RCDDVY": "Due to an addressing problem, your parcel has been redirected to the distribution site that serves your address.",
  "LIVRTI": "Your parcel has been delivered to the caretaker or to a neighbour.",
  "LIVSCO": "Delivered - Delivered to company",
  "LIVBPV": "Delivered - Delivered - Bulky letter box",
  "ATTCFM": "Parcel is being processed at facility",
  "RENJRC": "Not delivered - Parcel never received",
  "RENDAF": "Not delivered - Close at arrival",
  "DCHRMA": "The packaging of your parcel has been strengthened to ensure it can be delivered. It is being routed.",
  "DCHDDT": "Your parcel has left the office of exchange It is currently being routed in the destination country",
  "RENNJU": "Not delivered - Parcel will be delivered at new address",
  "AARHUB": "Your parcel has arrived at its delivery location.",
  "RENPRE": "Not delivered- Parcel available at drop point",
  "EXPQLT": "Your parcel has left the country of origin and is being shipped.",
  "INVPOI": "Not delivered - Parcel has been returned to facility",
  "DOUEXP": "The package has been cleared, and the package will continue to be delivered.",
  "RSTBRT": "Your parcel received by our agency is not compliant. It will be returned to the sender.",
  "ENEDOC": "The letterbox delivery service could not be carried out because the number indicated on the label did not correspond to that of the package to be recovered. A notification has been sent to you and tells you what to do.",
  "PCHTAR": "Your package was dropped off at a post office too late to leave today. It will leave tomorrow (or the next working day in case of Sunday or public holiday).",
  "ENEMQT": "Your package could not be retrieved because it was not present in the mailbox. You have 7 days from the date of purchase to drop it off at the post office.",
  "RENTEL": "Not delivered - Phone number missing - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "RSTNRV": "Your parcel will be delivered on the next working day and requires delivery to you in person. If you are away, you can let us know what your instructions are on www.colissimo.fr/monchoix.",
  "CITDOC": "After treatment by our services, your package is sent to the recipient. We ask you to accept our apologies.",
  "PCHCHM": "Your package is in transit to its country of origin.",
  "SOUOUV": "Parcel on hold - Awaiting for instructions - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "ECHMQT": "Your parcel received by our agency is not compliant. It will be returned to the sender.",
  "RENVIG": "Not delivered - Digicode missing",
  "ENEDAF": "Your package could not be retrieved because the mailbox was not found or accessible. You have 7 days from the date of purchase to send it to the post office.",
  "RENSPO": "Not delivered - Parcel lost - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "RENAVA": "Not delivered - Parcel damaged - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "RENAUT": "Shipment On Hold",
  "ENENCF": "Your package could not be collected because it did not include a postage label. You have 7 days from the date of purchase to drop it off at the post office.",
  "RENNRV": "Not delivered - New delivery date reschedulded",
  "RSTFMA": "Your parcel cannot be delivered currently since the delivery address cannot be accessed. We will try to deliver it as soon as possible.",
  "RENRLI": "Your parcel could not be delivered because the addressee was absent. We will try to deliver it as soon as possible.",
  "RSTNCG": "Your parcel could not be delivered on delivery by appointment. Our services will contact the addressee again.",
  "RENVVE": "Not delivered - Parcel oversized for letterbox",
  "RENHZD": "Not delivered - Out of distribution area - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "RENABS": "Not delivered - Not at home",
  "LIVPER": "Delivered - Delivered to Consignee",
  "RENPCO": "Not delivered - Digicode missing",
  "MLVARS": "Your parcel is available at your post office. The consignee has 15 business days to pick-up their parcel upon presentation of their pick-up voucher and proof of identity.",
  "MLVPLI": "Your parcel is being prepared for delivery.",
  "RENTAR": "The recipient refuses to accept the package because it takes too long to be delivered, and the package will be returned to the sender.",
  "LIVCFM": "Your parcel was delivered.",
  "LIVGAR": "Delivered - Delivered to Concierge",
  "LIVBPO": "Delivered - Delivered in Letter Box",
  "RENPAM": "Not delivered - Vehicule breakdown",
  "SOLREO": "Your parcel could not be delivered. It has been returned to the sender.",
  "RENPER": "Not delivered - Parcel lost - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "RENREF": "Not delivered - Refused Delivery - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "CHGRCA": "The wrapping of your package has been strengthened to ensure delivery.",
  "SOUCLO": "Parcel on hold - Instructions received - Parcel in transit",
  "RENRTI": "Your parcel could not be delivered. It will be made available in the addressee's post office.",
  "RSTDIL": "Your parcel will be delivered in an agreed time-slot on the date chosen by the addressee.",
  "RENDID": "Your parcel has not be picked up within the allocated time. It has been returned to the sender.",
  "RENINJ": "Not delivered - Consignee unreachable",
  "RENAVI": "Not delivered - Not at home - 2nd attempt  - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "RENCAD": "Not delivered - Bad address - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "RENLNA": "The package is re-delivered to the place designated by the recipient according to the recipient's request.",
  "SOLREI": "Parcel could not be delivered and returned to Colicoli hub - Parcel has been returned to sender",
  "MLVARX": "Your parcel is available in a different pick-up location from that initially selected. The addressee has been informed by email. The parcel can be picked up within 10 working days on presentation of an ID and the pick-up slip.",
  "ENEAVA": "You have chosen the letterbox delivery service for your package. Unfortunately, we were unable to perform the service because your package was damaged or opened. A notification has been sent to you and tells you what to do.",
  "DOUIIR": "Your parcel has been retained by our services due to a customs declaration problem. The parcel addressee will be contacted.",
  "LIVREO": "The parcel is delivered to the sender following a return",
  "COMCFM": "La Poste is handling your parcel. It is currently being routed.",
  "DOUDOU": "Your package is held by our services pending customs clearance.",
  "DCHCFM": "Your package has arrived in the recipient's country.",
  "RENCAT": "The parcel cannot currently be delivered to the Recipient: The delivery address is incomplete, we are looking for the unspecified part to deliver it. The recipient can contact our customer service to provide the necessary additional information.",
  "RENSRB": "Your package is returned to the sender, the cash on delivery was not accepted.",
  "RENGEO": "Not delivered - Bad address - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "PCHCFM": "The Postal operator of destination is handling your parcel. It is currently being routed.",
  "DCHDDC": "Your package is in the process of customs clearance.",
  "PAQCOM": "Parcel available at drop point",
  "RENDIV": "Your parcel has been returned to the sender following a refusal by the addressee.",
  "RSTFHB": "Your parcel cannot be delivered currently since the delivery address cannot be accessed. We will try to deliver it as soon as possible.",
  "RENDEM": "Not delivered - Customer has moved - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "DOUIDD": "Your parcel has been retained by our services due to a customs declaration problem. The parcel addressee will be contacted.",
  "MLVCFM": "Parcel is being delivered",
  "RENTER": "Not delivered - Parcel on hold",
  "RENDIA": "Your parcel could not be delivered. It has been returned to the sender.",
  "PAQPAR": "Parcel available at facility",
  "RENOUV": "Non Delivered - Package is opened - Thank you for contacting our customer service hotline:01 86 61 73 92",
  "RENARV": "The recipient was absent during the delivery of his package by appointment. He will be contacted shortly.",
  "DOUDDM": "Your package is held by our services for a customs declaration problem. The recipient of the package will be contacted.",
  "DOUFCM": "Your package is held by our services for an invoice problem. The recipient of the package will be contacted.",
  "DOUTAX": "Your package is in transit and will be delivered after payment of duties.",
  "DOUAGV": "Your parcel is undergoing customs clearance.",
  "RENFCO": "Your package could not be delivered to your collection point today. We are going to route it to a new point. You will receive a notification as soon as your package is available.",
  "DOURES": "Your parcel has been retained by our services due to an import licence problem. The parcel addressee will be contacted.",
  "SOLSAV": "Your parcel has suffered an incident. Please contact our customer service.",
  "RENREN": "The package is returned to the sender following a refusal by the recipient.",
  "LIVVOI": "Delivered - Delivered to neighbor",
  "RENAIN": "Your parcel cannot be delivered to the addressee currently since the delivery address is incomplete. The addressee can contact our customer service to provide the necessary additional information, by clicking on Contact Us online.",
  "RENECH": "Not delivered - The self pick-up cabinet is out of order.",
  "LIVLOC": "Your parcel has been delivered to the self pick-up cabinet",
  "CHNSDCL": "Online in Colissimo - No. colis",
  "RENINA": "Not delivered - Shop is closed",
  "RETURN_SCAN_ESENDEO": "Parcel has been returned to the Esendeo depot."
}
