{
  "PICKUP_ESENDEO": "Colis ramassé par Esendeo.",
  "STOCK_IN_ESENDEO": "Colis arrivé au dépôt d’Esendeo.",
  "STOCK_OUT_ESENDEO": "Colis ramassé par le transporteur.",
  "RST_BRT": "Votre colis est acheminé vers un point de retrait. Vous recevrez une notification dès que votre colis sera disponible.",
  "ND1": "Votre colis a été restitué à l'expéditeur sur sa demande.",
  "DOU_IDD": "Votre colis est en cours de dédouanement. Il est retenu par les services postaux pour une identification du contenu. Nos services peuvent être amenés à vous contacter.",
  "ENE_AVA": "Vous avez choisi le service d'envoi en boite aux lettres pour votre colis. Nous n'avons malheureusement pas pu réaliser la prestation car votre colis était endommagé ou ouvert. Une notification vous a été adressée et vous indique la marche à suivre.",
  "MD2": "Votre colis sera livré en seconde partie de journée.",
  "ESENDEO_STOCK": "Colis pris en charge par Esendeo.",
  "ENE_DOC": "Vous avez choisi le service d'envoi en boite aux lettres pour votre colis. Malheureusement la prestation n'a pas pu être réalisée car le numéro indiqué sur l'étiquette ne correspondait pas à celui du colis à récupérer. Une notification vous a été adressée et vous indique la marche à suivre.",
  "RST_PRO": "Le contenu de votre colis est prohibé, il ne pourra pas vous être livré.",
  "ET3": "Votre colis est arrivé dans le pays du destinataire.",
  "CIT_DOC": "Après traitement par nos services, votre colis est acheminé vers le destinataire. Nous vous prions d’accepter nos excuses.",
  "DR1": "Votre colis va être récupéré dans votre boite aux lettres dans les conditions prévues.",
  "DOU_RES": "Votre colis est en cours de dédouanement. Il est retenu par les services postaux en raison d'une licence manquante. Nos services peuvent être amenés à vous contacter.",
  "RE1": "En raison de votre refus pour cause de non-commande, votre colis est retourné à l'expéditeur.",
  "PB1": "L'acheminement de votre colis a été arrêté et votre colis ne vous sera pas livré. Nous vous invitons à vous rapprocher de votre expéditeur ou de notre service clients pour tout complément.",
  "DOU_TAX": "Votre colis est dédouané et il sera livré contre paiement de droits et taxes de douane.",
  "ENE_DAF": "Vous avez choisi le service d'envoi en boite aux lettres pour votre colis. Malheureusement la prestation n'a pas pu être réalisée car votre boite aux lettres n'a pas été trouvée ou elle était inaccessible. Une notification vous a été adressée et vous indique la marche à suivre.",
  "ENE_NCF": "Vous avez choisi le service d'envoi en boite aux lettres pour votre colis. Malheureusement la prestation n'a pas pu être réalisée car votre colis ne comportait pas d'étiquette. Une notification vous a été adressée et vous indique la marche à suivre.",
  "REN_AIN": "L'adresse de livraison est incomplète et nous ne pouvons pas vous livrer votre colis. Nous sommes à la recherche d'informations complémentaires nous permettant d'assurer la bonne livraison de votre colis. Vous pouvez contacter notre service clients pour apporter les compléments nécessaires.",
  "PB2": "Après traitement par nos services, votre colis est acheminé vers le destinataire. Nous vous prions d’accepter nos excuses.",
  "EP1": "Votre envoi n'a pas pu être distribué ce jour et sera remis en livraison au plus tôt. Le choix de la date de relivraison ou d'un point de retrait est possible jusqu'à minuit sur notre site internet.",
  "ET1": "Votre colis est en transit sur nos plateformes logistiques pour vous être livré le plus rapidement possible.",
  "CHG_CFM": "Votre colis est arrivé en France.",
  "DOU_AGV": "Votre colis est en cours de dédouanement.",
  "DI2": "Votre colis est livré à son expéditeur à la suite d'un retour.",
  "DOU_IIR": "Votre colis est retenu par les services postaux car des informations de dédouanement sont requises. Nos services peuvent être amenés à vous contacter.",
  "PCH_CHM": "Votre colis est en cours d'acheminement dans son pays d'origine.",
  "DO1": "Votre envoi est en cours de dédouanement.",
  "DOU_DDM": "Votre colis est en cours de dédouanement. Il est retenu par les services postaux en raison d'une déclaration en douane CN23 manquante. Nos services peuvent être amenés à vous contacter.",
  "ENE_MQT": "Vous avez choisi le service d'envoi en boite aux lettres pour votre colis. Malheureusement la prestation n'a pas pu être réalisée car votre colis ne se trouvait pas dans votre boite aux lettres. Une notification vous a été adressée et vous indique la marche à suivre.",
  "MLV_ARX": "Votre colis est disponible dans un point de retrait différent de celui prévu initialement. Il vous attend pendant un délai de 10 jours ouvrables. Ne tardez pas à aller le chercher ! Il vous sera remis sur présentation d'une pièce d'identité.",
  "AG1": "Votre colis vous attend dans votre point de retrait. Ne tardez pas à aller le chercher dans le délai qui vous a été indiqué !",
  "PC2": "Votre colis a été déposé par l'expéditeur chez notre partenaire postal dans son pays d'origine.",
  "50": "50",
  "75": "75",
  "125": "125",
  "150": "150",
  "155": "155",
  "250": "250",
  "CLEARED": "Dédouané",
  "DI1": "Votre colis est livré dans votre boite aux lettres.",
  "DO3": "Votre colis est en cours de dédouanement et il est retenu par les services postaux en raison d'une facture manquante. Nos services peuvent être amenés à vous contacter.",
  "ET2": "Votre colis est prêt à partir de son territoire d’expédition. Il va être remis au transporteur pour son acheminement",
  "PC1": "Votre colis a été déposé dans un point postal trop tardivement pour partir aujourd'hui. Il partira demain (ou le prochain jour ouvré en cas de dimanche ou jour férié).",
  "AAR_CFM": "Votre colis est arrivé sur son site de distribution",
  "AAR_DVY": "Votre colis a subi une erreur de tri, il a maintenant repris son acheminement.",
  "CHG_RCA": "L'emballage de votre colis a été renforcé pour assurer sa livraison.",
  "COM_CFM": "Votre colis est prêt à être expédié, il va être remis à La Poste.",
  "DCH_RCA": "Incident sur votre colis: celui-ci est renvoyé à l'expéditeur et nous vous prions d'accepter nos excuses.",
  "DCH_RMA": "L'emballage de votre colis a été renforcé pour en assurer sa livraison. Il est en cours d'acheminement.",
  "EXP_CFM": "Votre colis a quitté le pays d'origine.",
  "LIV_CFM": "Votre colis est livré.",
  "LIV_GAR": "Votre colis a été livré au gardien.",
  "LIV_REO": "Votre colis est livré à l'expéditeur suite à un retour.",
  "LIV_RTI": "Votre colis a été livré au gardien ou à un voisin.",
  "LIV_VOI": "Votre colis est livré au voisin indiqué sur l'avis déposé dans la boîte aux lettres du destinataire.",
  "MLV_ARS": "Votre colis est à disposition dans le point de retrait choisi. Il est à retirer pendant 10 jours ouvrables sur présentation d'une pièce d'identité et de l'avis d'instance.",
  "MLV_CFM": "Votre colis est en cours de livraison en point de retrait.",
  "PCH_CFM": "Votre colis est pris en charge par La Poste, il est en cours d'acheminement.",
  "PCH_CEX": "Votre colis est pris en charge par La Poste, il est en cours d'acheminement.",
  "RCD_DVY": "Votre colis est réacheminé vers un autre site de distribution en raison d'un défaut d'adressage.",
  "REN_ARV": "Votre colis n'a pu être livré car le destinataire était absent. Il sera remis en livraison le prochain jour ouvré.",
  "REN_AVA": "Votre colis est retourné à l'expéditeur suite à un refus du destinataire.",
  "REN_AVI": "Votre colis n'a pas pu être livré, il sera mis à disposition dans le bureau de Poste du destinataire.",
  "REN_CAD": "Votre colis ne peut actuellement être livré à son destinataire, l'adresse de livraison étant incomplète. Le destinataire peut contacter notre service clients pour apporter les compléments nécessaires, en cliquant sur Nous contacter en ligne.",
  "REN_DIA": "Votre colis n'a pas pu être livré, il est retourné à l'expéditeur.",
  "ECH_CFM": "Votre colis a été récupéré dans votre boite aux lettres.",
  "REN_DID": "Votre colis n'a pas été retiré dans les délais impartis , il est retourné à l'expéditeur.",
  "REN_DIV": "Votre colis est retourné à l'expéditeur suite à un refus du destinataire.",
  "REN_FCO": "Votre colis ne peut être livré dans le point de retrait choisi. Le destinataire sera informé du nouveau point de livraison.",
  "REN_LNA": "Votre colis est réexpédié à la demande du destinataire vers l'adresse de son choix.",
  "REN_NRV": "Votre colis n'a pas pu être livré car le destinataire était absent. Il sera remis en livraison le prochain jour ouvré.",
  "REN_SNC": "Votre colis est retourné à l'expéditeur suite à un refus du destinataire.",
  "REN_SRB": "Le colis est retourné à l'expéditeur, le destinataire a refusé de payer le contre-remboursement",
  "REN_TAR": "Votre colis est retourné à l'expéditeur suite à un refus du destinataire.",
  "RST_DIL": "Votre colis sera livré sur rendez-vous à la date choisie par le destinataire.",
  "RST_FHB": "Votre colis ne peut être livré ce jour, l'accès à l'adresse de livraison étant impossible. Il sera remis en livraison au plus tôt.",
  "RST_FMA": "Votre colis ne peut être livré ce jour, l'accès à l'adresse de livraison étant impossible. Il sera remis en livraison au plus tôt.",
  "RST_NCG": "Votre colis ne peut être livré ce jour. Il sera remis en livraison au plus tôt.",
  "SOL_MQD": "Votre colis a subi un incident. Nous vous remercions de prendre contact avec notre service clients, au 3631 pour les clients Particuliers auprès de vos interlocuteurs habituels pour les clients Entreprises.",
  "SOL_REO": "Votre colis est retourné à l'expéditeur.",
  "RST_NRV": "Le colis doit être remis en mains propres au destinataire. Rendez-vous sur www.colissimo.fr/monchoix pour donner vos instructions.",
  "DCH_CFM": "Votre colis est arrivé dans le pays de destination",
  "DCH_DDT": "Votre colis a quitté le bureau d'échange, il est en cours d'acheminement dans le pays de destination.",
  "DCH_DDC": "Votre colis est en instance de dédouanement",
  "DOU_FCM": "Facture manquante, votre colis est retenu par nos services dans l'attente de son dédouanement.",
  "DOU_EXP": "Votre colis est sorti de la douane.",
  "DOU_DOU": "Votre colis est retenu par nos services dans l'attente de son dédouanement.",
  "PCH_TAR": "Votre colis a été déposé au bureau de poste après l'heure limite de dépôt. Il sera expédié dès le prochain jour ouvré.",
  "UPS_AA": "THE SUITE NUMBER IS EITHER MISSING OR INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AB": "THE RECEIVER IS NOT LISTED IN THE BUILDING DIRECTORY. WE ARE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_AC": "THE CITY NAME IN THE ADDRESS IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AD": "THE COMPANY OR RECEIVER NAME IS INCORRECT. THIS WILL DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_AE": "THE STREET NUMBER IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AF": "THE STREET NAME IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AH": "THE ADDRESS HAS BEEN CORRECTED. THE DELIVERY HAS BEEN RESCHEDULED.",
  "UPS_AI": "WE'RE WORKING TO DELIVER YOUR PACKAGE AS SOON AS POSSIBLE.",
  "UPS_AK": "THE STATE SHOWN IN THE ADDRESS IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AL": "THE POSTAL CODE FOR THE RECEIVER IS INCORRECT. WE ARE ATTEMPTING TO OBTAIN CORRECT POSTAL CODE TO COMPLETE DELIVERY.",
  "UPS_AM": "THE RECEIVER HAS CANCELED THE PRODUCT ORDER AND REFUSED DELIVERY.",
  "UPS_AN": "THE RECEIVER DETERMINED THIS IS A DUPLICATE PRODUCT ORDER AND HAS REFUSED THE DELIVERY.",
  "UPS_AO": "THE CURRENCY TYPE IS MISSING FROM THE PACKAGE DOCUMENTATION. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_AP": "THE RECEIVER HAD NO INVOICE INFORMATION FOR THIS PACKAGE AND HAS REFUSED THE DELIVERY.",
  "UPS_AQ": "THE RECEIVER DOESN'T ACCEPT C.O.D.S AND REFUSED THE DELIVERY.",
  "UPS_AS": "THE RECEIVER DETERMINED  THIS PRODUCT ORDER IS LATE AND HAS REFUSED THE DELIVERY.",
  "UPS_AV": "RECEIVER'S ADDRESS IS A RURAL ROUTE. A STREET HAS NOT BEEN ASSIGNED. UPS IS ATTEMPTING TO ESTABLISH A DELIVERY LOCATION.",
  "UPS_AW": "YOUR PACKAGE CANNOT BE DELIVERED TO A RURAL ROUTE ADDRESS. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_AX": "THE RECEIVER IS ON VACATION.",
  "UPS_AY": "THE RECEIVING BUSINESS WAS CLOSED AT THE TIME OF THE FINAL DELIVERY ATTEMPT.",
  "UPS_AZ": "DELIVERY HAS BEEN RESCHEDULED DUE TO HOLIDAY CLOSURES.",
  "UPS_A5": "THE RECEIVER'S LOCATION WAS DAMAGED BY FIRE. WE'RE ATTEMPTING TO DETERMINE AN ALTERNATE DELIVERY ADDRESS.",
  "UPS_A6": "YOUR PACKAGE CANNOT BE DELIVERED TO A P.O. BOX. WE'RE ATTEMPTING TO OBTAIN AN ALTERNATE DELIVERY ADDRESS.",
  "UPS_A7": "THE RECEIVER HAS MOVED. WE'RE  ATTEMPTING TO OBTAIN A NEW DELIVERY ADDRESS FOR THIS RECEIVER.",
  "UPS_A8": "THE APARTMENT NUMBER IS EITHER MISSING OR INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_A9": "DIRECTIONS TO THE ADDRESS ARE REQUIRED TO COMPLETE DELIVERY. WE ARE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_BA": "ADDITIONAL DOCUMENTATION IS REQUIRED ON THE MERCHANDISE DESCRIPTION.",
  "UPS_BB": "THE SHIPMENT VALUE IS MISSING FROM THE INVOICE AND IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BD": "SHIPPER EXPORT DECLARATION DOCUMENTATION REQUIRED FOR EXPORT IS MISSING. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BE": "EXPORT LICENSE DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BF": "WE'RE ATTEMPTING TO GET FURTHER INSTRUCTIONS AND MAY RETURN THE SHIPMENT.",
  "UPS_BG": "TRANSIT OR BOND DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BH": "POWER OF ATTORNEY DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BJ": "AN IMPORT LICENSE IS MISSING AND IS REQUIRED FOR CLEARANCE",
  "UPS_BK": "CERTIFICATE OF ORIGIN DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BP": "A PHONE NUMBER IS REQUIED FOR CLEARANCE OR DELIVERY. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_BQ": "WE'VE ATTEMPTED TO CONTACT THE RECEIVER REGARDING PICKUP ARRANGEMENTS.",
  "UPS_BR": "WE'VE LEFT A MESSAGE FOR THE RECEIVER TO CONTACT US.",
  "UPS_BT": "WE'VE CONTACTED THE RECEIVER TO REQUEST ADDITIONAL INFORMATION.",
  "UPS_BU": "AS REQUESTED, THE PACKAGE WAS TRANSFERRED TO A FREE TRADE ZONE OR A NON-UPS BROKER.",
  "UPS_BV": "THE SHIPMENT IS BEING HELD BY BROKERAGE FOR REASONS BEYOND UPS' CONTROL",
  "UPS_BW": "YOUR PACKAGE HAS BEEN DELAYED DUE TO AN AGRICULTURAL HOLD.",
  "UPS_BX": "YOUR PACKAGE HAS BEEN DELAYED BY A CLEARANCE AGENCY WORK STOPPAGE.",
  "UPS_BZ": "THIS PACKAGE WAS ABANDONED BY BOTH THE SENDER AND RECEIVER.",
  "UPS_B1": "A WORK STOPPAGE AT THE RECEIVER'S LOCATION HAS PREVENTED DELIVERY.",
  "UPS_B3": "YOUR PACKAGE IS BEING PROCESSED FOR SUBMISSION TO THE FDA OR DEPARTMENT OF AGRICULTURE.",
  "UPS_B4": "YOUR PACKAGE HAS BEEN DELAYED DUE TO A FISH AND WILDLIFE AGENCY HOLD.",
  "UPS_B5": "A VALID TAX ID OR DEFERMENT NUMBER IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_B6": "A SPECIAL CUSTOMS CLEARANCE PROCEDURE IS REQUIRED FOR LIVE ENTRY.",
  "UPS_B8": "YOUR PACKAGE HAS BEEN DELAYED BY A CLEARANCE AGENCY. A HOLD WAS PLACED ON THE AIRPLANE.",
  "UPS_B9": "A MISSING COMMERCIAL INVOICE IS CAUSING A DELAY.",
  "UPS_CC": "WE'VE LEFT THE PACKAGE IN ONE OF OUR VEHICLES. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_CE": "THE PACKAGE CONTAINS A RESTRICTED COMMODITY. WE'LL PROCESS ACCORDING TO STANDARD PROTOCOL.",
  "UPS_CF": "WE DO NOT ACCEPT PACKAGES REQUIRING CARNET DOCUMENTATION.",
  "UPS_CG": "THE PACKAGE CONTAINS MULTIPLE, DIFFERING TRACKING NUMBERS.",
  "UPS_CH": "THE PACKAGE CONTAINS MULTIPLE, DUPLICATE TRACKING NUMBERS.",
  "UPS_CJ": "THE TRACKING NUMBER ON THIS PACKAGE HAS BEEN ALTERED/CHANGED",
  "UPS_CM": "A FLIGHT CANCELATION HAS DELAYED DELIVERY. WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_CN": "YOUR PACKAGE HAS BEEN DELAYED DUE TO AN EXPORT GATEWAY HOLD.",
  "UPS_CP": "YOUR PACKAGE HAS BEEN DELAYED DUE TO AN IMPORT GATEWAY HOLD.",
  "UPS_CQ": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_CS": "THE SENDER REQUESTED THAT WE RETURN THIS PACKAGE.",
  "UPS_CV": "YOUR PACKAGE EXCEEDS THE MAXIMUM WEIGHT WE CAN ACCEPT.",
  "UPS_CW": "WE CANNOT DELIVER TO AN APO OR FPO ADDRESS. WE'RE ATTEMPTING TO DETERMINE AN ALTERNATE DELIVERY ADDRESS.",
  "UPS_CX": "EXPORT DOCUMENTATION IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_CY": "WE WERE UNABLE TO OBTAIN COMPLETE  ADDRESS INFORMATION FOR YOUR PACKAGE.",
  "UPS_CZ": "HAZARDOUS MATERIALS LABELING IS MISSING AND IS REQUIRED FOR CLEARANCE. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_C1": "TRANSFERRED TO A LOCAL AGENT FOR DELIVERY. THE DELIVERY WILL BE RESCHEDULED.",
  "UPS_C3": "THE CONTENTS OF YOUR PACKAGE ARE SUBJECT TO EXPORT RESTRICTIONS AND MAY CAUSE A DELIVERY DELAY.",
  "UPS_C4": "THE RECEIVER WAS NOT AVAILABLE AT THE TIME OF THE DELIVERY ATTEMPT.",
  "UPS_C5": "AN EMERGENCY SITUATION OR SEVERE WEATHER CONDITION HAS DELAYED DELIVERY.",
  "UPS_C6": "DELIVERY WILL BE DELAYED BY ONE BUSINESS DAY.",
  "UPS_C7": "THE C.O.D. AMOUNT IS MISSING FROM THE LABEL. WE'RE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_C8": "THE RECEIVER IS NO LONGER IN BUSINESS.",
  "UPS_C9": "YOUR PACKAGE EXCEEDS THE MAXIMUM LENGTH WE CAN ACCEPT.",
  "UPS_DA": "YOUR PACKAGE WAS RELEASED BY THE CLEARING AGENCY.",
  "UPS_DB": "YOUR PACKAGE WILL BE HELD AT A WAREHOUSE UNTIL IT IS RELEASED BY THE CLEARANCE AGENCY.",
  "UPS_DC": "YOUR PACKAGE ARRIVED LATE TO THE DESTINATION CITY. YOU SHOULD EXPECT AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_DD": "WE'RE UNABLE TO CONTACT THE RECEIVER.",
  "UPS_DE": "CLEARING AGENCY IS REQUIRING AN INVOICE COMPARISON TO THE ITEMS BEING SHIPPED",
  "UPS_DF": "A NATURAL DISASTER HAS DELAYED DELIVERY. WE ARE READY TO DELIVER AS SOON AS CONDITIONS ALLOW.",
  "UPS_DG": "CIVIL UNREST HAS DELAYED DELIVERY. WE ARE READY TO DELIVER AS SOON AS CONDITIONS ALLOW.",
  "UPS_DH": "YOUR PACKAGE HAS BEEN DELAYED DUE TO EVENTS BEYOND OUR CONTROL. WE'RE ADJUSTING DELIVERY PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_DJ": "SEVERE WEATHER CONDITIONS HAVE DELAYED DELIVERY.",
  "UPS_DN": "THE NUMBER OF PACKAGES DOES NOT MATCH THE INVOICE, WAYBILL OR LABEL. WE'RE WORKING TO RESOLVE THIS DISCREPANCY.",
  "UPS_DQ": "THIS DELIVERY ADDRESS IS IN A REMOTE AREA WHERE DELIVERIES ARE NOT MADE DAILY.",
  "UPS_DR": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_DT": "WE'VE CONTACTED THE RECEIVER TO REQUEST ADDITIONAL INFORMATION.",
  "UPS_DU": "WE WERE UNABLE TO LOAD THE PACKAGE ON THE PLANE AS SCHEDULED.",
  "UPS_DW": "THE DELIVERY LOCATION IS VACANT.",
  "UPS_DY": "WE ARE AWAITING PAYMENT AUTHORIZATION FROM THE RECEIVER.",
  "UPS_D1": "WE'VE MISROUTED THE PACKAGE. THIS MAY CAUSE A DELAY.",
  "UPS_D2": "THE COMMODITY VALUE OF YOUR PACKAGE EXCEEDS THE LIMIT WE ALLOW.",
  "UPS_D4": "THE SERVICE SELECTED IS NOT AVAILABLE TO THIS DESTINATION ADDRESS. THIS HAS DELAYED DELIVERY.",
  "UPS_D7": "WE'LL CONTACT THE SENDER OR RECEIVER ABOUT THIS DELIVERY.",
  "UPS_ED": "WE'VE LEFT THE PACKAGE IN ONE OF OUR CONTAINERS. THIS MAY CAUSE A DELAY.",
  "UPS_EH": "YOUR PACKAGE MAY BE DELAYED. WE ARE ADJUSTING DELIVERY PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_EN": "YOUR PACKAGE MAY BE DELAYED. WE ARE ADJUSTING DELIVERY PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_EO": "WE'VE ARRANGED A SPECIAL FLIGHT TO COMPLETE YOUR DELIVERY.",
  "UPS_ER": "YOUR PACKAGE IS AWAITING RELEASE FROM THE CLEARING AGENCY.",
  "UPS_ES": "YOUR PACKAGE ENTRY WAS REJECTED BY THE CLEARING AGENCY. WE WILL PROCESS ACCORDING TO THE SENDER'S INSTRUCTIONS.",
  "UPS_EU": "DOCUMENTATION REQUIRED FOR IMPORT IS INCOMPLETE OR MISSING. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_EV": "ADDITIONAL DOCUMENTATION IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_EW": "TRANSLATED DOCUMENTS ARE REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_EX": "YOUR PACKAGE EXCEEDS THE MAXIMUM WEIGHT WE CAN ACCEPT.",
  "UPS_E1": "THE FLOOR NUMBER IS EITHER MISSING OR INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_E2": "PACKAGE MUST BE PICKED UP WITHIN 5 BUSINESS DAYS.",
  "UPS_E3": "WE LEFT THE PACKAGE IN OUR FACILITY. THIS MAY CAUSE A DELAY. WE WILL DELIVER AS QUICKLY AS POSSIBLE.",
  "UPS_E4": "YOUR PACKAGE HAS BEEN DELAYED DUE TO A GOVERNMENT REGULATORY AGENCY HOLD.",
  "UPS_E8": "YOUR PACKAGE WAS QUARANTINED AS REQUESTED BY A GOVERNMENT REGULATORY AGENCY.",
  "UPS_E9": "YOUR PACKAGE WAS HELD FOR CENSORSHIP REVIEW BY A GOVERNMENT AGENCY.",
  "UPS_FA": "WE WERE UNABLE TO OBTAIN ADDITIONAL ADDRESS INFORMATION.",
  "UPS_FE": "THE RECEIVER DISPUTES OR REFUSES TO PAY DUTY OR TAXES FOR THE PACKAGE.",
  "UPS_FF": "WE ARE AWAITING RETURN TO SENDER AUTHORIZATION FOR THE PACKAGE.",
  "UPS_FK": "THE PACKAGE WAS RETURNED USING THE RETURN LABEL PROVIDED.",
  "UPS_FM": "AN ADULT SIGNATURE IS REQUIRED TO COMPLETE THIS DELIVERY. UPS WILL MAKE A FINAL ATTEMPT.",
  "UPS_FN": "RECEIVER ACKNOWLEDGES RECEIPT",
  "UPS_FT": "THE RECEIVER HAS PICKED UP THEIR PACKAGE.",
  "UPS_FW": "WE'VE REQUESTED A UPS PROACTIVE RESPONSE INTERCEPT FOR THIS PACKAGE.",
  "UPS_F4": "DELIVERED",
  "UPS_GF": "ADDITIONAL INFORMATION IS NEEDED FROM THE IMPORTER TO PROVIDE DUTY RELIEF FOR SHIPMENT REPAIRED AT ORIGIN.",
  "UPS_GH": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_GI": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_GZ": "A LETTER OF CREDIT IS IN PROGRESS. YOUR PACKAGE WILL BE HELD UNTIL APPROVAL IS COMPLETE.",
  "UPS_G1": "AS REQUESTED BY THE SENDER, THE PACKAGE WILL BE DELIVERED LATER THAN THE NORMAL DELIVERY TIME FOR YOUR AREA.",
  "UPS_G3": "THE RECEIVING BUSINESS WAS CLOSED AT THE TIME OF THE FIRST DELIVERY ATTEMPT. A SECOND ATTEMPT WILL BE MADE.",
  "UPS_G4": "THE PACKAGE WAS NOT READY AT THE TIME OF THE FIRST PICKUP ATTEMPT. A SECOND ATTEMPT WILL BE MADE.",
  "UPS_G5": "THE PACKAGE WAS NOT READY FOR PICKUP AT THE TIME OF THE FINAL ATTEMPT.",
  "UPS_G6": "A REQUIRED SECURITY CHECK HAS DELAYED DELIVERY.",
  "UPS_G7": "AN ADULT SIGNATURE IS REQUIRED TO COMPLETE THIS DELIVERY. UPS WILL MAKE A SECOND ATTEMPT.",
  "UPS_G8": "UPS WAS NOT ABLE TO SECURE AN ADULT SIGNATURE FOR THIS DELIVERY. DELIVERY WAS NOT MADE.",
  "UPS_G9": "YOUR PACKAGE MAY BE DELAYED DUE TO A REQUIRED X-RAY INSPECTION.",
  "UPS_HA": "A TRANSPORTATION ACCIDENT HAS DELAYED DELIVERY.",
  "UPS_HF": "PICKUP SCAN",
  "UPS_HJ": "YOUR PACKAGE WAS UPGRADED TO A NEW SERVICE LEVEL.",
  "UPS_HK": "THIS PACKAGE CONTAINS ALCOHOL AND WE ARE UNABLE TO DELIVER OR RETURN IT TO THE SENDER. WE'LL CONTACT THE SENDER.",
  "UPS_HL": "YOUR PACKAGE WAS PROCESSED AT OUR FACILITY",
  "UPS_HM": "THE PACKAGE HAS BEEN REDIRECTED AND FORWARDED TO THE DELIVERY CENTER.",
  "UPS_HO": "THIS PACKAGE CONTAINS ALCOHOL AND WILL BE HELD FOR PICKUP BY THE SENDER ONLY.",
  "UPS_HQ": "WE'VE LEFT A NOTICE ABOUT THE PACKAGE.",
  "UPS_HR": "THE PACKAGE WAS DAMAGED IN TRANSIT. WE WILL NOTIFY THE SENDER WITH DETAILS.",
  "UPS_H1": "THE STREET TYPE SHOWN IN THE ADDRESS IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_H2": "THE STREET PREFIX IS EITHER MISSING OR INCORRECT. THIS MAY DELAY DELIVERY.  WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_H3": "THE STREET SUFFIX IS INCORRECT. THIS MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_H4": "THE BOROUGH OR COUNTY SHOWN IN THE ADDRESS IS INCORRECT AND MAY DELAY DELIVERY. WE'RE ATTEMPTING TO UPDATE THE ADDRESS.",
  "UPS_H5": "INCOMPLETE ADDRESS INFORMATION MAY DELAY DELIVERY. WE ARE ATTEMPTING TO UPDATE THIS INFORMATION.",
  "UPS_H6": "WE RECEIVED A REQUEST TO CHANGE DELIVERY. THIS REQUEST WILL BE PROCESSED ONCE THE PACKAGE RETURNS TO OUR FACILITY.",
  "UPS_H7": "THE DELIVERY AREA IS INACCESSIBLE DUE TO A SPECIAL EVENT. WE'RE ADJUSTING PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_H8": "THE PACKAGE IS BEING RETURNED TO THE SENDER AT A DIFFERENT SERVICE LEVEL.",
  "UPS_H9": "A HAZARDOUS MATERIALS IRREGULARITY OCCURRED WITH THIS PACKAGE. WE'LL CONTACT THE SENDER WITH ADDITIONAL INFORMATION.",
  "UPS_IJ": "THE DELIVERY IS RESCHEDULED.",
  "UPS_I1": "AS REQUESTED BY THE SENDER, THE PACKAGE IS BEING RETURNED. CONACT THE SENDER FOR ADDITIONAL INFORMATION.",
  "UPS_I2": "THIS PACKAGE CONTAINS ALCOHOL AND WE ARE UNABLE TO DELIVER OR RETURN IT TO THE SENDER. WE'LL CONTACT THE SENDER.",
  "UPS_I3": "YOU CAN MAKE ALTERNATE DELIVERY ARRANGEMENTS BY CALLING 1-800-457-4022 AND ENTERING YOUR TRACKING NUMBER.",
  "UPS_JA": "AS REQUESTED BY THE SENDER, THE DELIVERY CHANGE FOR THIS PACKAGE WAS COMPLETED.",
  "UPS_JB": "WE HAVE UPDATED THE DELIVERY INFORMATION FOR YOUR PACKAGE.",
  "UPS_JC": "THE UPS PROACTIVE RESPONSE INTERCEPT FOR YOUR PACKAGE WAS COMPLETED.",
  "UPS_JH": "THE SENDER REQUESTED A MODIFIED INTERCEPT FOR THIS PACKAGE.",
  "UPS_JI": "WE'VE REQUESTED A MODIFIED INTERCEPT FOR THIS PACKAGE.",
  "UPS_JJ": "THE UPS PROACTIVE RESPONSE INTERCEPT FOR YOUR PACKAGE WAS MODIFIED.",
  "UPS_J8": "DISPATCH FOR ONE ADDITIONAL DAY",
  "UPS_J9": "REFRIGERATE",
  "UPS_KI": "THE RECEIVER REFUSED TO PAY THE C.O.D. AMOUNT FOR THIS PACKAGE.",
  "UPS_KM": "THE PACKAGE WAS DELIVERED AT THE RECEIVER'S LOCATION.",
  "UPS_KN": "THE RECEIVER CHOSE TO KEEP THE PACKAGE.",
  "UPS_KO": "WE'VE CONTACTED THE RECEIVER.",
  "UPS_KP": "THE PACKAGE WILL BE RETURNED TO THE SENDER.",
  "UPS_KR": "THE RECEIVER DOES NOT WANT THE PRODUCT AND REFUSED THE DELIVERY.",
  "UPS_KS": "THE RECEIVER STATES THE PRODUCT WAS NOT ORDERED AND HAS REFUSED THE DELIVERY.",
  "UPS_KT": "THE RECEIVER REFUSED THE DELIVERY.",
  "UPS_KX": "THE RECEIVER WAS NOT AVAILABLE AT THE TIME OF THE SECOND DELIVERY ATTEMPT. A FINAL ATTEMPT WILL BE MADE.",
  "UPS_KY": "THE PACKAGE WAS NOT READY AT THE TIME OF THE SECOND PICKUP ATTEMPT. A FINAL ATTEMPT WILL BE MADE.",
  "UPS_KZ": "THE DRIVER WAS UNABLE TO COLLECT FUNDS ON THE SECOND DELIVERY ATTEMPT. A FINAL ATTEMPT WILL BE MADE.",
  "UPS_K1": "WE'VE MISSED THE SCHEDULED PICKUP TIME. THIS MAY CAUSE A DELAY.",
  "UPS_K2": "SENDER TENDERED THE SHIPMENT TO UPS AFTER THE LATEST PICKUP TIME FOR THE REQUESTED SERVICE. A DAY DELAY IS LIKELY.",
  "UPS_K5": "A GUARANTEED SERVICE REFUND HAS BEEN REQUESTED FOR THIS PACKAGE.",
  "UPS_K6": "A GUARANTEED SERVICE REFUND HAS BEEN VOIDED FOR THIS PACKAGE.",
  "UPS_K7": "THE RECEIVER HAS ACKNOWLEDGED RECEIPT OF THIS PACKAGE.",
  "UPS_K8": "A UPS PROACTIVE RESPONSE INTERCEPT FOR THIS PACKAGE HAS BEEN COMPLETED.",
  "UPS_LE": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_LF": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_LH": "SATURDAY GUARANTEED SERVICE IS NOT AVAILABLE IN THE DESTINATION ZIP CODE.",
  "UPS_LI": "THE SHIPMENT IS BEING HELD IN THE LOGISTICS LOCATION FOR A FUTURE DELIVERY DATE.",
  "UPS_LN": "THE DAMAGE INSPECTION REQUEST HAS BEEN CHANGED.",
  "UPS_LO": "THE DAMAGE INSPECTION REQUEST HAS BEEN REISSUED.",
  "UPS_LQ": "WE'VE SCHEDULED AN INSPECTION OF THE DAMAGED CONTENTS AND PACKAGING. WE'LL PROVIDE THE SENDER WITH THE RESULTS.",
  "UPS_LV": "YOUR PACKAGE WAS FORWARDED TO A GOVERNMENT AGENCY FOR INVESTIGATION.",
  "UPS_LX": "PACKAGE TRANSFERRED TO POST OFFICE",
  "UPS_LY": "THE SHIPMENT IS IN TRANSIT FOR FINAL DELIVERY. DELIVERY IS SCHEDULED IN APPROXIMATELY 1-2 DAYS.",
  "UPS_LZ": "AT THE SENDER'S REQUEST, WE'LL MAKE ONLY ONE DELIVERY ATTEMPT. THE RECEIVER MUST PICK UP THE PACKAGE AT A UPS FACILITY.",
  "UPS_L1": "THE RECEIVING BUSINESS WAS CLOSED AT THE TIME OF THE SECOND DELIVERY ATTEMPT. A FINAL ATTEMPT WILL BE MADE.",
  "UPS_L2": "DUE TO A PRICE DISCREPANCY, THE RECEIVER HAS REFUSED TO PAY THE CHARGES.",
  "UPS_L3": "A GOVERNMENT AGENCY HAS REQUESTED A RE-EVALUATION OF THE INVOICED PACKAGE VALUE.",
  "UPS_L5": "THE DESCRIPTION OF THE CONTENTS OF YOUR PACKAGE DOES NOT MATCH THE DOCUMENTATION.",
  "UPS_MF": "THE RECEIVER HAS REQUESTED THAT WE HOLD THIS PACKAGE FOR A FUTURE DELIVERY DATE",
  "UPS_MI": "YOUR PACKAGE WAS RETURNED TO THE IMPORT SITE AND IS AWAITING CLEARANCE.",
  "UPS_MT": "WE'VE MISSED THE SCHEDULED TRANSFER TIME. THIS MAY CAUSE A DELAY.",
  "UPS_NI": "THE PACKAGE WAS DISCARDED AT THE SENDER'S REQUEST. PLEASE CONTACT THE SENDER FOR DETAILS.",
  "UPS_NV": "WE'VE RECEIVED PAYMENT AND WILL DELIVER YOUR PACKAGE.",
  "UPS_OM": "MISSING INFORMATION FROM THE SENDER MAY DELAY DELIVERY. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_OQ": "YOUR PACKAGE IS BEING HELD FOR PAYMENT OF DUTY AND TAX.",
  "UPS_OS": "YOUR PACKAGE IS BEING DELAYED DUE TO THE PROCESSING INVOLVED WITH HANDLING LITHIUM BATTERIES.",
  "UPS_O1": "A DELIVERY CHANGE FOR THIS PACKAGE IS IN PROGRESS.",
  "UPS_O2": "WE'VE MODIFIED THE REQUESTED CHANGE OF DELIVERY FOR YOUR PACKAGE.",
  "UPS_O3": "WE RECEIVED AN ADDITIONAL REQUEST TO CHANGE THE DELIVERY OF THIS PACKAGE. THE REQUEST IS IN PROGRESS.",
  "UPS_O4": "THE PACKAGE WILL BE RETURNED TO THE SENDER.",
  "UPS_O5": "THE RECEIVER ARRANGED TO PICK UP THE PACKAGE AT A UPS FACILITY.",
  "UPS_O6": "WE'VE RESCHEDULED THIS DELIVERY.",
  "UPS_O7": "YOUR PACKAGE WILL BE DELIVERED TO AN ALTERNATE ADDRESS.",
  "UPS_O8": "THE RECEIVER ARRANGED TO PICK UP THIS PACKAGE AT A UPS FACILITY.",
  "UPS_O9": "THE RECEIVER ARRANGED FOR SAME-DAY WILL CALL.",
  "UPS_PI": "THE RECEIVER DID NOT PRESENT PROPER IDENTIFICATION CONTAINING THE DELIVERY ADDRESS.",
  "UPS_PP": "WE HAVE RETURNED THE PACKAGE TO THE SENDER USING THE PACKAGE RETURN LABEL.",
  "UPS_RA": "THE FEDERAL COMMUNICATION COMMISSION REQUIRES ADDITIONAL INFORMATION BEFORE THE PACKAGE CAN BE RELEASED.",
  "UPS_RB": "YOUR PACKAGE IS AWAITING CLEARANCE RELATED TO THE TOXIC SUBSTANCE CONTROL ACT.",
  "UPS_RC": "YOUR PACKAGE IS AWAITING CLEARANCE RELATED TO DEPARTMENT OF TRANSPORTATION REQUIREMENTS.",
  "UPS_RD": "YOUR PACKAGE IS AWAITING CLEARANCE RELATED TO THE DEPARTMENT OF ALCOHOL, TOBACCO & FIREARMS REQUIREMENTS.",
  "UPS_RE": "YOUR PACKAGE IS BEING HELD BY THE CLEARING AGENCY FOR MARKING-REGULATIONS VERIFICATION.",
  "UPS_RF": "SATURDAY DELIVERY HAS BEEN REQUESTED.",
  "UPS_RG": "THE OPERATING FACILITY ACCEPTED THE REQUEST.",
  "UPS_RH": "THE OPERATING FACILITY WAS NOT ABLE TO MEET THE REQUEST.",
  "UPS_RI": "YOUR PACKAGE CONTAINS AN FDA-RESTRICTED COMMODITY. WE'RE UNABLE TO OBTAIN CLEARANCE.",
  "UPS_RJ": "YOUR PACKAGE IS BEING HELD TO PREPARE BOND PAPERWORK FOR ALTERNATE SITE CLEARANCE BY A NON-UPS BROKER.",
  "UPS_RM": "A GOVERNMENT AGENCY HAS PLACED A HOLD ON YOUR PACKAGE.",
  "UPS_RO": "DELIVERY WILL BE RESCHEDULED FOR SATURDAY.",
  "UPS_RP": "YOUR PACKAGE HAS BEEN DELAYED BY CUSTOMS OR OTHER GOVERNMENT AGENCY.",
  "UPS_RR": "INVOICE AND RECEIVER FEDERAL TAX ID # REQUIRED FOR SUBMISSION TO  U.S. CUSTOMS",
  "UPS_RS": "MORE DETAILED COMMODITY INFORMATION & RECEIVER'S TAX ID REQUIRED FOR SUBMISSION TO CUSTOMS",
  "UPS_RU": "WE CURRENTLY HAVE THE PACKAGE. THE RECEIVER REQUESTED CLEARANCE BY A NON-UPS BROKER.",
  "UPS_RV": "WE WILL RETURN THE PACKAGE TO THE SENDER ON SATURDAY.",
  "UPS_RW": "WE WILL MAKE A SECOND DELIVERY ATTEMPT TODAY.",
  "UPS_RX": "CLEARANCE AND POWER OF ATTORNEY REQUIRED FOR SUBMISSION TO U.S. CUSTOMS",
  "UPS_RY": "A NON-UPS LABOR DISPUTE HAS DELAYED DELIVERY. WE'RE WORKING TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_RZ": "YOUR PACKAGE IS AWAITING RELEASE FROM THE CLEARING AGENCY FOR FORMAL ENTRY AT THE EXPORT LOCATION.",
  "UPS_R1": "DETAILED COMMODITY INFORMATION & ADHERENCE TO CUSTOMS COUNTRY OR ORIGIN MARKING REQUIREMENTS",
  "UPS_R4": "ADDITIONAL INFORMATION IS REQUIRED. YOUR PACKAGE IS PENDING RELEASE FROM A GOVERNMENT AGENCY OTHER THAN CUSTOMS.",
  "UPS_R5": "WE'VE SUBMITTED DOCUMENTATION TO A GOVERNMENT AGENCY AND ARE AWAITING A RESPONSE.",
  "UPS_R6": "POWER OF ATTORNEY & MORE DETAILED COMMODITY INFORMATION REQUIRED FOR SUBMISSION TO U.S. CUSTOMS",
  "UPS_R7": "POWER OF ATTORNEY & RECEIVER FEDERAL TAX ID # REQUIRED FOR SUBMISSION TO U.S. CUSTOMS",
  "UPS_SF": "THE CLEARING AGENCY IS EXPERIENCING TECHNICAL DIFFICULTIES AND IS TEMPORARILY UNABLE TO TRANSMIT PACKAGE INFORMATION.",
  "UPS_SH": "THIS PACKAGE HAS MORE THAN ONE RECEIVER AND REQUIRES SPECIAL HANDLING TO ENSURE PROPER DELIVERY.",
  "UPS_SI": "YOUR SHIPMENT WAS NOT PROCESSED BY UPS BROKERAGE. THIS HAS CAUSED A DELAY.",
  "UPS_SJ": "THIS RETURNED PACKAGE REQUIRES AN EXPORT INVOICE FOR DUTY RELIEF.",
  "UPS_SK": "YOUR SHIPMENT WAS NOT PROCESSED BY UPS BROKERAGE AND HAS NOT CLEARED CUSTOMS. THIS HAS CAUSED A DELAY.",
  "UPS_SL": "ADDITIONAL DOCUMENTS ARE REQUIRED FOR DUTY RELIEF.",
  "UPS_SM": "ORIGINAL GSP CERTIFICATE REQUIRED FOR DUTY RELIEF",
  "UPS_SN": "DOCUMENTATION FOR PERSONAL BELONGINGS IS MISSING AND IS REQUIRED FROM THE RECEIVER.",
  "UPS_SP": "TEMPORARY-IMPORT DETAILS ARE REQUIRED FROM THE RECEIVER.",
  "UPS_SR": "YOUR PACKAGE IS AT THE CLEARING AGENCY AWAITING FINAL RELEASE.",
  "UPS_SS": "YOUR PACKAGE MAY BE DELAYED DUE TO A REQUIRED DOCUMENT INSPECTION BY THE CLEARING AGENCY.",
  "UPS_SV": "AS REQUESTED, THE PACKAGE IS MOVING IN-BOND TO A NON-UPS OFF-SITE BROKER FOR CLEARANCE.",
  "UPS_SX": "YOUR PACKAGE IS IN TRANSIT. WE'RE UPDATING PLANS TO SCHEDULE YOUR DELIVERY.",
  "UPS_SY": "INSPECTION REQUESTED BY CUSTOMS OR UPS",
  "UPS_S1": "YOUR PACKAGE MAY BE DELAYED DUE TO ADDRESS VERIFICATION BY THE CLEARING AGENCY.",
  "UPS_S2": "THIS PACKAGE REQUIRES SPECIAL ENTRY. THE RECEIVER WILL BE REQUIRED TO PREPARE ADDITIONAL PAPERWORK AFTER CLEARANCE.",
  "UPS_S3": "THE PACKAGE HAS CLEARED CUSTOMS, HOWEVER, A CLEARANCE STICKER IS REQUIRED BY THE RECEIVER.",
  "UPS_S4": "THE PACKAGE WAS EXPORTED OUT OF A EUROPEAN UNION COUNTRY, BUT NOT IN FREE CIRCULATION. CUSTOMS CLEARANCE IS REQUIRED.",
  "UPS_S5": "WE'RE WORKING TO RESOLVE TECHNICAL ISSUES TEMPORARILY PREVENTING US FROM TRANSMITTING INFORMATION TO THE CLEARING AGENCY",
  "UPS_S6": "THE RECEIVER WILL ONLY ACCEPT DELIVERY DURING CERTAIN HOURS. WE'RE ADJUSTING DELIVERY PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_S7": "THE RECEIVER REQUESTED THIS PACKAGE TO BE HELD FOR PICKUP AT THE UPS FACILITY.",
  "UPS_S8": "A LATE UPS TRAILER ARRIVAL HAS CAUSED A DELAY. WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_S9": "WE'VE SENT THE PACKAGE TO UPS LOST AND FOUND.",
  "UPS_TA": "WE'VE CONTACTED THE SENDER.",
  "UPS_TB": "THE RECEIVER REQUESTED A TEMPORARY CHANGE TO THE DELIVERY ADDRESS.",
  "UPS_TC": "C.O.D. INFORMATION NEEDS TO BE VALIDATED BY SENDER TO COMPLETE DELIVERY",
  "UPS_TD": "UNABLE TO CONTACT CUSTOMER-UPS SENT A NEXT DAY LETTER TO THE RECEIVER",
  "UPS_TE": "AS REQUESTED, THE PACKAGE IS MOVING IN-BOND TO AN ALTERNATE LOCATION FOR REGULATORY CLEARANCE.",
  "UPS_TF": "WE REQUIRE A PHONE NUMBER FOR THE DELIVERY ADDRESS.",
  "UPS_TG": "A SAMPLE OF THE SHIPMENT WAS TAKEN BY CLEARING AGENCY",
  "UPS_TH": "YOUR DELIVERY HAS BEEN RESCHEDULED FOR THE NEXT BUSINESS DAY.",
  "UPS_TI": "SERVICE DISRUPTION OCCURRED",
  "UPS_TJ": "WE SENT THE PACKAGE TO UPS LOST AND FOUND.",
  "UPS_TK": "WE WILL CONTACT THE SENDER.",
  "UPS_TN": "WE'RE UNABLE TO DELIVER YOUR PACKAGE.",
  "UPS_TO": "SAME DAY WILL CALL FOR COURIER PICK UP",
  "UPS_TP": "SHIPMENT DESTROYED BY CLEARING AGENT",
  "UPS_TS": "THE RETURN LABEL WAS DISCARDED.",
  "UPS_TT": "PACKAGE RESUBMITTED TO CLEARING AGENCY FOR CLEARANCE",
  "UPS_TU": "ADDRESS INFORMATION IS MISSING. THE PACKAGE WAS RETURNED TO THE SENDER.",
  "UPS_T3": "THE SENDER REQUESTED THAT WE HOLD THIS PACKAGE.",
  "UPS_T4": "THE SENDER REQUESTED A CHANGE TO THE SERVICE FEATURES.",
  "UPS_T5": "THE CUSTOMER HAS REQUESTED A CHANGE TO THE C.O.D AMOUNT",
  "UPS_T6": "THE CUSTOMER HAS REQUESTED THAT A SIGNATURE NO LONGER BE REQUIRED FOR THE DELIVERY OF THIS PACKAGE",
  "UPS_T7": "YOUR PACKAGE HAS BEEN PLACED IN A CLIMATE CONTROLLED ENVIRONMENT.",
  "UPS_T8": "YOUR PACKAGE HAS BEEN REMOVED FROM A CLIMATE CONTROLLED ENVIRONMENT.",
  "UPS_T9": "THE RECEIVER REQUESTED A CUSTOMS BROKER OTHER THAN UPS.",
  "UPS_UE": "A SPECIAL ACCOUNT PACKAGE IS BEING HELD AT THE UPS FACILITY FOR PICKUP. THE PICKUP MUST BE MADE WITHIN 5 BUSINESS DAYS.",
  "UPS_UG": "THE PACKAGE IS BEING HELD FOR A FUTURE DELIVERY DATE. WE'LL ATTEMPT TO DELIVER ON THE DATE REQUESTED.",
  "UPS_UM": "WE'RE INVESTIGATING THE DAMAGE CLAIM.",
  "UPS_UN": "THE PACKAGE CONTAINS AN UNAUTHORIZED TOBACCO COMMODITY, AND WE ARE UNABLE TO COMPLETE THE DELIVERY.",
  "UPS_UO": "LOST PACKAGE INVESTIGATION",
  "UPS_UP": "WE'RE ATTEMPTING TO VERIFY THE PACKAGE LOCATION.",
  "UPS_UW": "UNPAID COD INVESTIGATION",
  "UPS_UX": "INVESTIGATION ONLY",
  "UPS_UY": "DAMAGE TO PACKAGE CONTENTS WAS REPORTED. WE WILL NOTIFY THE SENDER.",
  "UPS_UZ": "SAME DAY WILL CALL FOR COURIER PICK UP",
  "UPS_VA": "THE RECEIVER CANCELED THE WILL CALL AND WE WILL ATTEMPT DELIVERY.",
  "UPS_VB": "WILL-CALL PICKUP MUST BE MADE WITHIN 5 BUSINESS DAYS.",
  "UPS_VD": "UPS WILL REDELIVER TO SAME ADDRESS ON DAY AFTER SAME DAY WILL CALL REQUEST",
  "UPS_VE": "THE RECEIVER AGREED TO PICK UP THE PACKAGE THIS EVENING.",
  "UPS_VG": "WE'LL ATTEMPT TO REDELIVER TODAY.",
  "UPS_VH": "WE'VE CONFIRMED ARRANGEMENTS.",
  "UPS_VI": "UNABLE TO CONTACT CUSTOMER AT PRIMARY NUMBER",
  "UPS_VJ": "UNABLE TO CONTACT CUSTOMER AT ALTERNATE NUMBER",
  "UPS_VK": "THE PACKAGE IS AWAITING CLEARING AGENCY REVIEW.",
  "UPS_VL": "THE BUSINESS IS CLOSED FOR THE WEEKEND. THERE'S A MIDDLE EAST WEEKEND DELIVERY DELAY DUE TO DIFFERENT WORK PRACTICES.",
  "UPS_VM": "AS REQUESTED, THE DELIVERY CHANGE WAS COMPLETED.",
  "UPS_VN": "THE RECEIVER ARRANGED FOR SAME-DAY PICKUP AT A UPS FACILITY.",
  "UPS_VQ": "MRN (MOVEMENT REFERENCE NUMBER) PROVIDED BY CUSTOMER DUE TO HIGH CUSTOMS VALUE OF SHIPMENT",
  "UPS_VR": "MRN (MOVEMENT REFERENCE NUMBER) PROVIDED BY UPS DUE TO HIGH CUSTOMS VALUE OF SHIPMENT",
  "UPS_W8": "AS REQUESTED, THE PACKAGE IS NOW IN TRANSIT TO A FREE TRADE ZONE.",
  "UPS_XB": "YOUR PACKAGE IS DELAYED DUE TO SIMPLIFIED/CONSOLIDATED ENTRY. ADDITIONAL IMPORT INFORMATION OR DOCUMENTS ARE REQUIRED.",
  "UPS_XC": "DUE TO COMMODITY OR WEIGHT, YOUR PACKAGE IS BEING HELD TO VERIFY VALUE.",
  "UPS_XE": "ORIGINAL DOCUMENTS REQUIRED (IMMIGRATION DOCUMENTS, VISA, ETC)",
  "UPS_XG": "INCORRECT CURRENCY CODE ON THE INVOICE",
  "UPS_XJ": "THE CLEARING AGENCY IS CLOSED. WE WILL SUBMIT THE PACKAGE FOR CLEARANCE ONCE THEIR OFFICE REOPENS.",
  "UPS_XK": "SHIPMENT REQUIRES INSPECTION BY BOTH FISH & WILDLIFE AND AGRICULTURE PPQ BEFORE SUBMISSION TO CUSTOMS",
  "UPS_XL": "SHIPMENT REQUIRES INSPECTION BY BOTH FISH & WILDLIFE AND FOOD AND DRUG ADMINISTRATION BEFORE SUBMISSION TO CUSTOMS",
  "UPS_XN": "WE MUST CONTACT THE RECEIVER FOR IMPORT REQUIREMENTS TO CLEAR THE PACKAGE, BUT THE RECEIVER'S PHONE # IS INVALID.",
  "UPS_XO": "INVOICE DOCUMENTATION INFORMATION WAS DISPUTED AT IMPORT AND MUST BE VALIDATED BY THE SENDER.",
  "UPS_XQ": "SHIPPER, MANUFACTURER AND/OR REGISTRATION #'S REQUIRED BY BIOTERRORISM ACT (BTA) FOR PRIOR NOTICE (PN) IS/ARE MISSING",
  "UPS_XS": "SHIPPER, MANUFACTURER AND/OR REGISTRATION #'S MISSING FOR PN PER BIOTERRORISM ACT (BTA) & HELD FOR AGRICULTURE INSPECT",
  "UPS_XU": "SHIPPER, MANUFACTURER AND/OR REGISTRATION NUMBERS MISSING FOR PN PER BIOTERRORISM ACT (BTA) & MISSING THE INVOICE",
  "UPS_XV": "THE SHIPMENT IS BEING HELD. COMMODITY DESCRIPTION INFORMATION MUST BE VALIDATED BY THE SENDER.",
  "UPS_XW": "THE SENDER MUST PROVIDE A UNIQUE CUSTOMS IDENTIFICATION NUMBER SO THAT THE PACKAGE CAN BE CLEARED.",
  "UPS_XY": "YOUR PACKAGE IS DELAYED AT EXPORT AND IS AWAITING RELEASE FROM CUSTOMS.",
  "UPS_XZ": "YOUR PACKAGE WAS CLEARED AFTER THE SCHEDULED TRANSPORT DEPARTURE. WE WILL RESCHEDULE FOR THE NEXT AVAILABLE DEPARTURE.",
  "UPS_X2": "YOUR PACKAGE IS AWAITING RELEASE FROM THE CLEARING AGENCY FOR FORMAL ENTRY AT THE IMPORT LOCATION.",
  "UPS_X3": "YOUR PACKAGE HAS BEEN DELAYED BY A CLEARING AGENCY HOLD.",
  "UPS_X4": "YOUR PACKAGE HAS BEEN DELAYED DUE TO INCORRECT TARIFF CLASSIFICATION WHICH MUST BE RESUBMITTED TO THE CLEARING AGENCY.",
  "UPS_X5": "CLEARING AGENCY REQUIRES AUTHORIZATION FROM THE TRADEMARK HOLDER PRIOR TO IMPORT AND RELEASE. WE'LL CONTACT THE SENDER.",
  "UPS_X6": "IMMIGRATION DOCUMENTS REQUIRED BY CUSTOMS PRIOR TO RELEASE OF SHIPMENT",
  "UPS_X7": "CUSTOMS REQUIRES THAT MULTIPLE PACKAGES SHIPPING ON THE SAME DAY TO THE SAME IMPORTER BE COMBINED INTO ONE SHIPMENT.",
  "UPS_X8": "THE COUNTRY OF ORIGIN IS MISSING AND IS REQUIRED FOR CLEARANCE. WE'RE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_X9": "AS REQUESTED BY THE RECEIVER, WE'LL HOLD THE PACKAGE, AND CONTACT THEM FOR INSTRUCTION BEFORE SUBMITTING FOR CLEARANCE.",
  "UPS_YA": "AS REQUESTED, WE HAVE GIVEN DOCUMENTATION TO AN ALTERNATE BROKER AND ARE AWAITING CLEARANCE.",
  "UPS_YD": "THE POST OFFICE ATTEMPTED TO DELIVER YOUR UPS SUREPOST PACKAGE AND LEFT A DELIVERY NOTICE WITH INSTRUCTIONS.",
  "UPS_YE": "THE POST OFFICE ATTEMPTED TO DELIVER THE UPS SUREPOST PACKAGE, BUT THE RECEIVER REFUSED DELIVERY.",
  "UPS_YF": "THE POST OFFICE WAS UNABLE TO DELIVER THE UPS SUREPOST PACKAGE AS ADDRESSED. PLEASE CONTACT THE SENDER FOR ASSISTANCE.",
  "UPS_YG": "THE POST OFFICE FORWARDED THE UPS SUREPOST PACKAGE TO THE RECEIVER'S ADDRESS ON FILE.",
  "UPS_YI": "YOUR UPS SUREPOST PACKAGE WAS TRANSFERRED TO THE WRONG POST OFFICE. IT IS BEING CORRECTED.",
  "UPS_YJ": "THE POST OFFICE WAS UNABLE TO DELIVER THE UPS SUREPOST PACKAGE AS ADDRESSED AND RETURNED IT TO THE SENDER.",
  "UPS_YK": "THE POST OFFICE WAS UNABLE TO DELIVER THE UPS SUREPOST PACKAGE AND RETURNED IT TO THE SENDER.",
  "UPS_YL": "THE POST OFFICE WAS UNABLE TO DELIVER YOUR UPS SUREPOST PACKAGE.  IT IS BEING SENT TO THE POSTAL DISPOSAL SITE.",
  "UPS_YM": "THE POST OFFICE WAS UNABLE TO DELIVER YOUR UPS SUREPOST PACKAGE. IT IS BEING SENT TO THE POSTAL RECOVERY SITE.",
  "UPS_YR": "YOUR PACKAGE IS AT THE UPS DISTRIBUTION FACILITY AND IS SCHEDULED FOR DELIVERY ON THE NEXT BUSINESS DAY.",
  "UPS_YS": "AS REQUESTED BY THE SENDER, THIS PACKAGE REQUIRES SPECIAL HANDLING.",
  "UPS_YT": "THE UPS RETURNS? PACK AND COLLECT BOX REQUESTED BY THE SENDER IS NOT AN APPROPRIATE MATCH FOR THE GOODS TO BE RETURNED.",
  "UPS_YU": "THE CONTENTS OF THE PACKAGE BEING RETURNED DO NOT MATCH THE DESCRIPTION PROVIDED BY THE SENDER.",
  "UPS_YV": "THE RETURN LABEL WAS MISSING. WE'RE UNABLE TO RETURN THE PACKAGE TO THE SENDER.",
  "UPS_YW": "A UPS RETURNS PACK AND COLLECT BOX WAS NOT REQUESTED BY THE SENDER. THE GOODS CANNOT BE PICKED UP.",
  "UPS_YX": "THE SENDER MUST REQUEST ANOTHER PICKUP AND MUST ENSURE THAT THE APPROPRIATE PACK AND COLLECT BOX TYPE IS SELECTED.",
  "UPS_Y1": "THE PACKAGE IS AT THE CLEARING AGENCY AWAITING FINAL RELEASE.",
  "UPS_Y2": "WE'VE REQUESTED THAT THE RECEIVER CONTACT US.",
  "UPS_Y3": "WE'VE CONTACTED THE RECEIVER.",
  "UPS_Y4": "SHIPMENT TRANSFERRED TO LOCAL GOVT AGENCY AND IS TEMPORARILY OUT OF UPS CONTROL",
  "UPS_Y5": "DOCUMENTS OR INFO REQUESTED FROM THE CUSTOMER WERE RECEIVED AND ARE BEING PROCESSED FOR CLEARANCE",
  "UPS_Y6": "AUTHORIZATION RECEIVED FROM THE CUSTOMER",
  "UPS_Y7": "THE PACKAGE IS BEING HELD FOR A FUTURE DELIVERY DATE.",
  "UPS_Y9": "THE PACKAGE IS SCHEDULED FOR TRANSFER TO THE POST OFFICE BY THE NEXT BUSINESS DAY. ALLOW AT LEAST TWO DAYS FOR DELIVERY.",
  "UPS_ZA": "A UPS MY CHOICE DELIVERY CHANGE WAS REQUESTED FOR THIS PACKAGE.",
  "UPS_ZB": "AT THE RECEIVER'S REQUEST, THE UPS MY CHOICE DELIVERY CHANGE OPTION WAS MODIFIED.",
  "UPS_ZC": "AS REQUESTED, THE UPS MY CHOICE DELIVERY CHANGE WAS COMPLETED.",
  "UPS_ZD": "DELIVER TO A UPS ACCESS POINT.",
  "UPS_ZL": "DELIVERY TO UPS ACCESS POINT PENDING.",
  "UPS_ZM": "THE POST OFFICE ATTEMPTED DELIVERY OF YOUR UPS SUREPOST PACKAGE, BUT THE RECEIVING BUSINESS WAS CLOSED.",
  "UPS_ZN": "PACKAGE HAS BEEN DISPATCHED FROM THE USPS INTERNATIONAL SERVICE CENTER FOR FINAL DELIVERY TO RECEIVER.",
  "UPS_ZO": "THE UPS ACCESS POINT HAS PREPARED THE PACKAGE FOR RETURN TO UPS.",
  "UPS_ZP": "DELIVERED TO UPS ACCESS POINT; AWAITING CUSTOMER PICKUP.",
  "UPS_Z1": "BROKERAGE RELEASED THE PACKAGE. IT WILL BE PROCESSED THROUGH A CLEARING AGENCY BEFORE FINAL RELEASE TO UPS.",
  "UPS_Z3": "RECEIVER'S CUSTOMS BROKER HAS BEEN ASSIGNED. THE SHIPMENT IS NOW RELEASED TO MOVE IN TRANSIT",
  "UPS_Z5": "TEMPORARY BOND IS RELEASED BY CUSTOMS, THE CONSIGNEE MAY NOT OPEN THE SHIPMENT UNTIL THE FOLLOWING BUSINESS DAY AT NOON",
  "UPS_01": "THE PACKAGE WAS MISSED AT THE DESTINATION LOCATION",
  "UPS_02": "DELIVERY WILL BE RESCHEDULED.",
  "UPS_03": "WE'VE MISSED THE SCHEDULED TRANSFER TIME. THIS MAY CAUSE A DELAY.",
  "UPS_04": "A UPS PROCESSING ERROR HAS DELAYED DELIVERY. WE'RE ADJUSTING PLANS AS QUICKLY AS POSSIBLE.",
  "UPS_05": "A REQUIRED REGULATORY INSPECTION HAS DELAYED DELIVERY. WE'RE WORKING TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_06": "WE'VE MISROUTED THE PACKAGE. THIS MAY CAUSE A DELAY.",
  "UPS_07": "WE'VE MISROUTED THE PACKAGE. THIS MAY CAUSE A DELAY.",
  "UPS_08": "WE'VE HELD THE PACKAGE AT THIS FACILITY. THIS MAY CAUSE A DELAY.",
  "UPS_11": "THE PACKAGE DID NOT ARRIVE AT THE DESTINATION.",
  "UPS_14": "THE SERVICE HAS BEEN CHANGED AND THE DELIVERY IS BEING RESCHEDULED.",
  "UPS_15": "A TRAIN DERAILMENT HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_16": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_17": "A LATE UPS TRAILER ARRIVAL HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_18": "A LATE FLIGHT HAS CAUSED A DELAY. WE'RE ADJUSTING PLANS AND WORKING TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_19": "A LATE UPS TRAILER ARRIVAL HAS CAUSED A DELAY. WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_2A": "RECENT WEATHER HAS CAUSED DELIVERY DELAYS.  RECOVERY EFFORTS ARE UNDER WAY TO DELIVER YOUR PACKAGE AS SOON AS POSSIBLE.",
  "UPS_2B": "THE MILITARY PACKAGE IS BEING HELD FOR DUTY FREE CLEARANCE PENDING PAPERWORK.",
  "UPS_2R": "THE POST OFFICE WAS UNABLE TO DELIVER YOUR UPS SUREPOST PACKAGE AND RETURNED IT TO UPS. WE WILL RETURN TO THE SENDER.",
  "UPS_2S": "UPS WILL ATTEMPT TO DELIVER.",
  "UPS_2U": "WE'LL BE IN YOUR AREA AND WILL DELIVER YOUR UPS SUREPOST PACKAGE INSTEAD OF THE POST OFFICE.",
  "UPS_2V": "YOUR PACKAGE WAS SENT BACK TO THE POST OFFICE FOR DELIVERY.",
  "UPS_2X": "CUSTOMER WAS NOT AVAILABLE ON 1ST ATTEMPT. DELIVERY WILL BE MADE TO A NEARBY UPS ACCESS POINT FOR CUSTOMER TO PICK UP.",
  "UPS_2Y": "WE HAVE NOT YET UNLOADED THE PACKAGE FROM THE TRAILER. THIS MAY DELAY DELIVERY.",
  "UPS_2Z": "WE WERE UNABLE TO DISPATCH THE TRAILER ON TIME. THIS MAY CAUSE A DELAY.",
  "UPS_22": "WE WERE UNABLE TO DISPATCH THE TRAILER ON TIME. THIS MAY CAUSE A DELAY.",
  "UPS_23": "A MECHANICAL FAILURE  HAS DELAYED DELIVERY.  WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_3A": "WE'VE LEFT THE PACKAGE IN OUR FACILITY. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_3B": "WE HAVE NOT YET UNLOADED THE PACKAGE FROM THE TRAILER.",
  "UPS_3C": "A UPS FACILITY OUTAGE HAS DELAYED DELIVERY. WE'RE ADJUSTING PLANS TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_3J": "UPS ACCESS POINT CLOSED, PACKAGE NOT DELIVERED. ANOTHER ATTEMPT WILL BE MADE TO A UPS ACCESS POINT",
  "UPS_3L": "UPS ACCESS POINT UNABLE TO ACCEPT PACKAGE. ANOTHER ATTEMPT WILL BE MADE TO A UPS ACCESS POINT.",
  "UPS_3N": "THE PACKAGE WAS NOT PICKED UP BY THE RECEIVER AT THE UPS ACCESS POINT AND WILL BE RETURNED TO SENDER.",
  "UPS_3P": "PACKAGE HAS BEEN RECEIVED FROM UPS ACCESS POINT. UPS WILL PROCESS AS NECESSARY.",
  "UPS_3Q": "THE PACKAGE UPGRADE HAS BEEN PROCESSED.",
  "UPS_3R": "UPGRADE COMPLETED; DELIVER TO ANOTHER ADDRESS",
  "UPS_3S": "AS REQUESTED, PACKAGE WAS UPGRADED AND HOLD-FOR-PICKUP WILL BE PROCESSED. PACKAGE NOT YET AVAILABLE FOR PICKUP.",
  "UPS_3U": "UPGRADE COMPLETED; RESCHEDULED DELIVERY",
  "UPS_3V": "UPGRADE COMPLETED; DELIVER TO UPS ACCESS POINT",
  "UPS_3W": "THE REQUEST FOR A SERVICE UPGRADE THROUGH UPS MY CHOICE WAS NOT COMPLETED.",
  "UPS_30": "THE REQUEST FOR THIS PACKAGE WAS CANCELLED",
  "UPS_31": "WE'VE LEFT THE PACKAGE IN OUR FACILITY. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_33": "THE BILLING OPTION SELECTED IS NOT VALID FOR THIS PACKAGE.",
  "UPS_34": "WE'VE INCORRECTLY SORTED THE PACKAGE AT OUR FACILITY. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_39": "THE SENDER REQUESTED THIS PACKAGE BE HELD FOR PICKUP AT A UPS FACILITY.",
  "UPS_4G": "WE WERE REQUIRED TO WAIT IN ORDER TO COMPLETE THE PICKUP.",
  "UPS_4H": "WE WERE REQUIRED TO USE THE LIFT GATE IN ORDER TO COMPLETE THE PICKUP.",
  "UPS_4I": "THE PACKAGE IS IN STORAGE.",
  "UPS_4J": "SHIPMENT REMOVED FROM STORAGE",
  "UPS_4K": "WE WERE REQUIRED TO WAIT IN ORDER TO COMPLETE THE DELIVERY.",
  "UPS_4L": "WE WERE REQUIRED TO USE THE LIFT GATE IN ORDER TO COMPLETE THE DELIVERY.",
  "UPS_4M": "WORLDWIDE EXPRESS FREIGHT - CUSTOMER HAS REQUESTED RE-DELIVERY ATTEMPT",
  "UPS_4N": "UPGRADE WILL NOT BE PROCESSED, NOR ANY UPS MY CHOICE DELIVERY CHANGE, IF REQUESTED",
  "UPS_4P": "THE PACKAGE IS EITHER OVERWEIGHT OR OVERSIZED. WE REQUIRE PRE-AUTHORIZATION FOR DELIVERY.",
  "UPS_4Q": "REQUIRES APPROVAL",
  "UPS_4R": "THE PACKAGE IS BEING RETURNED TO THE SENDER OR RE-DELIVERED BY A FREIGHT FORWARDING SERVICE.",
  "UPS_4S": "THE PACKAGE WAS RETURNED TO THE SENDER VIA FREIGHT FORWARDING.",
  "UPS_4T": "APPROVED FOR TRANSIT",
  "UPS_4Y": "YOUR SHIPMENT IS SCHEDULED TO ARRIVE TODAY AFTER THE DELIVERY COMMITMENT TIME",
  "UPS_4Z": "THE ADDRESS LABEL BECAME DETACHED FROM THE PACKAGE. THE SENDER WILL BE NOTIFIED.",
  "UPS_46": "THE SERVICE SELECTED IS NOT AVAILABLE TO THIS DESTINATION ADDRESS. THIS HAS DELAYED DELIVERY.",
  "UPS_47": "WE DO NOT CURRENTLY SERVE THE DESTINATION ADDRESS FOR THIS PACKAGE.",
  "UPS_48": "THE RECEIVER WAS NOT AVAILABLE AT THE TIME OF THE FIRST DELIVERY ATTEMPT. A SECOND ATTEMPT WILL BE MADE.",
  "UPS_49": "THE RECEIVER WAS NOT AVAILABLE AT THE TIME OF THE FINAL DELIVERY ATTEMPT.",
  "UPS_5D": "THE CUSTOMER CANCELLED THE PACKAGE DROPOFF; UPS DOES NOT HAVE THIS PACKAGE",
  "UPS_5G": "THE PACKAGE REMAINS AT THE UPS ACCESS POINT AND IS REACHING THE AGED DATE",
  "UPS_5R": "CUSTOMER WAS NOT AVAILABLE WHEN UPS ATTEMPTED DELIVERY. WILL DELIVER TO A NEARBY UPS ACCESS POINT FOR CUSTOMER PICKUP.",
  "UPS_5S": "REROUTE TO AN ALTERNATE UPS ACCESS POINT FOR DELIVERY AND CUSTOMER PICKUP",
  "UPS_5T": "PACKAGE HELD; UPS WILL CONTACT CUSTOMER FOR FURTHER INSTRUCTIONS",
  "UPS_5U": "THE ORIGINAL UPS ACCESS POINT IS NOT AVAILABLE FOR DELIVERY. WE'LL CONTACT RECEIVER FOR AN ALTERNATE DELIVERY LOCATION.",
  "UPS_5V": "DELIVERY COULD NOT BE MADE TO THE ORIGINAL UPS ACCESS POINT. PKG WILL BE DELIVERED TO ANOTHER NEARBY UPS ACCESS POINT.",
  "UPS_5W": "THE ORIGINAL UPS ACCESS POINT IS NOT AVAILABLE. DELIVERY TO AN ALTERNATE UPS ACCESS POINT PENDING.",
  "UPS_5Z": "DELIVERY TO UPS ACCESS POINT UNSUCCESSFUL; A SECOND ATTEMPT AT THE RECEIVER'S ADDRESS WILL BE MADE",
  "UPS_51": "THE DRIVER WAS UNABLE TO COLLECT FUNDS ON THE FIRST DELIVERY ATTEMPT. A SECOND ATTEMPT WILL BE MADE.",
  "UPS_52": "THE DRIVER WAS UNABLE TO COLLECT FUNDS ON THE FINAL DELIVERY ATTEMPT.",
  "UPS_54": "THE RECEIVER ARRANGED TO PICK UP THE PACKAGE AT A UPS FACILITY. PICKUP MUST BE MADE WITHIN 5 BUSINESS DAYS.",
  "UPS_55": "THE RECEIVING BUSINESS WAS CLOSED.",
  "UPS_56": "THIS DELIVERY WAS MADE AFTER THE UPS SERVICE COMMITMENT TIME OF NOON",
  "UPS_59": "THIS DELIVERY WAS MADE AFTER THE UPS SERVICE COMMITMENT TIME OF 10:30 A.M",
  "UPS_6B": "PACKAGES ARE READY FOR PICKUP DUE TO UPS ACCESS POINT CLOSING. CUSTOMER WILL BE CONTACTED FOR NEXT STEPS.",
  "UPS_6C": "PACKAGES ARE READY FOR UPS PICKUP AND WILL BE RETURNED DUE TO AGING.",
  "UPS_6D": "WE'RE WORKING TO DELIVER YOUR PACKAGE AS SOON AS POSSIBLE.",
  "UPS_6E": "YOUR PACKAGE WAS NOT RECEIVED AT THE UPS FACILITY AS ORIGINALLY SCHEDULED. THIS MAY CAUSE A DELAY.",
  "UPS_6G": "MODIFICATION OF THE RECEIVER'S ADDRESS",
  "UPS_6H": "AS REQUESTED, UPS MY CHOICE PACKAGE WILL BE DELIVERED TO CUSTOMER'S PREFERRED UPS ACCESS POINT",
  "UPS_6I": "AS REQUESTED, PACKAGE WILL BE RETRIEVED FROM UPS ACCESS POINT AND RE-DELIVERED TO ORIGINAL ADDRESS",
  "UPS_6J": "DELIVERY TO A UPS ACCESS POINT LOCATION IS PENDING.",
  "UPS_6K": "PACKAGE WILL BE DELIVERED TO THE UPS ACCESS POINT ON THE NEXT BUSINESS DAY",
  "UPS_6L": "PACKAGE NOT ELIGIBLE FOR UPS ACCESS POINT DELIVERY; WILL RE-ATTEMPT DELIVERY AT THE ORIGINAL ADDRESS",
  "UPS_6P": "PACKAGE IN TRANSIT AND SCHEDULED FOR UPS DELIVERY ATTEMPT TO RECIPIENT ON NEXT UPS BUSINESS DAY",
  "UPS_6R": "CUSTOMER NOT IN ON 1ST ATTEMPT. DELIVERY WILL BE MADE TO A UPS ACCESS POINT NEXT BUSINESS DAY FOR CUSTOMER PICKUP.",
  "UPS_6S": "THE PACKAGE EXCEEDS WEIGHT OR SIZE LIMIT FOR UPS ACCESS POINT LOCATIONS; DELIVER PACKAGE TO RECIPIENT",
  "UPS_6T": "THE C.O.D. EXCEEDS THE AMOUNT ALLOWED FOR UPS ACCESS POINT LOCATIONS. WE WILL CONTACT THE RECEIVER.",
  "UPS_6U": "THE SELECTED UPS ACCESS POINT DOES NOT ACCEPT C.O.D.'S. WE WILL REROUTE OR CONTACT THE RECEIVER.",
  "UPS_6W": "THE PACKAGE HAS REMAINED AT THE UPS ACCESS POINT LOCATION BEYOND THE MAXIMUM DAYS ALLOWED.",
  "UPS_6X": "WE WILL CONTACT THE SENDER FOR INSTRUCTIONS.",
  "UPS_6Z": "UPS MY CHOICE MEMBER'S CHOSEN UPS ACCESS POINT PREFERENCES ARE NOT AVAILABLE",
  "UPS_60": "YOUR PACKAGE CONTAINS HAZARDOUS MATERIALS. WE WILL NOT TRANSPORT THIS PACKAGE BY AIR.",
  "UPS_7C": "SUREPOST PACKAGE WAS UPGRADED AND SENT TO CUSTOMER'S UPS ACCESS POINT PREFERENCE",
  "UPS_7D": "SUREPOST PACKAGE WAS UPGRADED TO UPS GROUND; UPS WILL DELIVER PACKAGE TO UPS ACCESS POINT",
  "UPS_7E": "SUREPOST PACKAGE UPGRADED TO UPS GROUND, BUT PREFERRED UPS ACCESS POINT IS UNAVAILABLE; UPS WILL CONTACT CUSTOMER",
  "UPS_7F": "THE RECEIVER MUST PAY THE DUTIES OR TAXES DUE ON THE PACKAGE.",
  "UPS_7G": "DISRUPTION IN NETWORK - TRACTOR TRAILER",
  "UPS_7H": "THE PACKAGE IS MISSING DUTY INFORMATION AND WILL BE RETURNED TO EXPORT LOCATION.",
  "UPS_7I": "THE PACKAGE MISSED THE SCHEDULED RAIL CONNECTION.",
  "UPS_7J": "R2R PACKAGE REFUSED AT THE UPS ACCESS POINT - HOLD PACKAGE AND CONTACT SHIPPER",
  "UPS_7L": "RECEIVER NOT AVAILABLE. UPS ACCESS POINT SERVICE CANCELED. WILL MAKE 2ND DELIVERY ATTEMPT AT THE RECEIVER'S ADDRESS.",
  "UPS_7M": "YOUR PACKAGE IS BEING HELD TO PREPARE BOND PAPERWORK FOR ALTERNATE SITE CLEARANCE BY A UPS BROKER.",
  "UPS_7N": "AN OPERATIONAL ERROR MAY DELAY DELIVERY. WE'RE WORKING TO DELIVER YOUR PACKAGE AS QUICKLY AS POSSIBLE.",
  "UPS_7P": "THE IMPORTER HAS NOT ASSIGNED A BROKER. THIS MAY DELAY DELIVERY.",
  "UPS_7Q": "THE RECEIVER HAS REQUESTED THAT WE MAKE AN APPOINTMENT FOR DELIVERY.",
  "UPS_7R": "UPS DELAYED THE PACKAGE DURING THE AVIATION SECURITY SCREENING",
  "UPS_7S": "A GOVERNMENT AGENCY DELAYED THE PACKAGE DURING THE AVIATION SECURITY SCREENING",
  "UPS_7T": "THE PACKAGE IS BEING HELD BECAUSE IT'S MISSING THE IPPC (INTERNATIONAL PLANT PROTECTION CONVENTION) STAMP.",
  "UPS_7U": "THE COMMODITY IS NOT IN THE IMPORTER'S DATABASE. UPS BROKERAGE WILL CONTACT THE IMPORTER.",
  "UPS_7V": "AN EMERGENCY SITUATION OR SEVERE WEATHER CONDITION HAS DELAYED DELIVERY.",
  "UPS_7W": "SEVERE WEATHER CONDITIONS HAVE DELAYED DELIVERY.",
  "UPS_7X": "RECENT WEATHER HAS CAUSED DELIVERY DELAYS.  RECOVERY EFFORTS ARE UNDER WAY TO DELIVER YOUR PACKAGE AS SOON AS POSSIBLE.",
  "UPS_7Y": "WE'VE LEFT THE PACKAGE IN OUR FACILITY. THIS MAY CAUSE AT LEAST ONE BUSINESS DAY DELAY.",
  "UPS_7Z": "DELIVERY WILL BE DELAYED BY ONE BUSINESS DAY.",
  "UPS_71": "EXPORT DOCUMENTATION IS INCOMPLETE OR MISSING. WE ARE WORKING TO OBTAIN THIS INFORMATION.",
  "UPS_72": "THE PACKAGE WILL BE HELD UNTIL ALL PACKAGES ASSOCIATED WITH THIS SHIPMENT HAVE ARRIVED.",
  "UPS_73": "THE PACKAGE CONTAINS ARTICLES THAT UPS PROHIBITS FOR INTERNATIONAL SHIPPING.",
  "UPS_76": "SCHEDULED FOR DELIVERY TODAY",
  "UPS_77": "THE PACKAGE WILL BE FORWARDED TO A UPS FACILITY IN THE DESTINATION CITY.",
  "UPS_78": "THE SENDER REQUESTED A DELIVERY CHANGE FOR THIS PACKAGE.",
  "UPS_79": "WE UPDATED THE DELIVERY INFORMATION FOR YOUR PACKAGE.",
  "UPS_8A": "SENDER TENDERED THE SHIPMENT TO UPS AFTER THE LATEST PICKUP TIME FOR THE REQUESTED SERVICE. A DAY DELAY IS LIKELY.",
  "UPS_8C": "AFTER FURTHER REVIEW, YOUR PACKAGE MAY NOT HAVE ARRIVED ON-SCHEDULE. VISIT UPS.COM/TARIFF FOR TERMS AND CONDITIONS.",
  "UPS_8D": "THE PACKAGE WAS ABANDONED BY THE CUSTOMER AND WILL BE SURRENDERED TO CUSTOMS.",
  "UPS_8E": "AFTER FURTHER REVIEW, YOUR PACKAGE MAY NOT HAVE ARRIVED ON-SCHEDULE. VISIT UPS.COM/TARIFF FOR TERMS AND CONDITIONS.",
  "UPS_8F": "AFTER FURTHER REVIEW, YOUR PACKAGE MAY NOT HAVE ARRIVED ON-SCHEDULE. VISIT UPS.COM/TARIFF FOR TERMS AND CONDITIONS.",
  "UPS_8G": "THE UPS SUREPOST PACKAGE WAS MISROUTED. IT IS CURRENTLY BEING TRANSFERRED TO THE CORRECT USPS OFFICE FOR FINAL DELIVERY.",
  "UPS_84": "THE FREIGHT SHIPMENT IS OUT FOR DELIVERY",
  "UPS_87": "THE FREIGHT SHIPMENT IS DELAYED",
  "UPS_90": "THERE IS AN EMBARGO ON THE DESTINATION COUNTRY, AND THE PACKAGE WILL BE RETURNED TO THE SENDER.",
  "UPS_91": "THE C.O.D. TAG IS EITHER ILLEGIBLE OR INVALID.",
  "UPS_92": "THE RECEIVER HAS AGREED TO ACCEPT THE DELIVERY CHARGES",
  "UPS_93": "PACKAGE COULD NOT BE LOCATED FOR INTERCEPT",
  "UPS_95": "OUR DRIVER REQUIRES SECURITY ACCESS FOR THIS DELIVERY. WE ARE ATTEMPTING TO OBTAIN THE ACCESS INFORMATION.",
  "UPS_99": "PLEASE CONTACT UPS FOR ADDITIONAL INFORMATION.",
  "UPS_MP": "Commande traitée : prête à être gérée par UPS.",
  "UPS_XD": "L'envoi a été déposé et se trouve maintenant à un point d'accès UPS.",
  "UPS_2Q": "Livré au point d'accès UPS",
  "UPS_KB": "Livré",
  "UPS_2W": "Colis pris en charge au point d'accès UPS",
  "UPS_FS": "Livré",
  "UPS_AR": "Lecture à l'arrivée",
  "UPS_AT": "Lecture à Air Transit",
  "UPS_BY": "Bypass ULO",
  "UPS_CA": "Arrivée annulée",
  "UPS_CD": "Départ annulé",
  "UPS_CK": "Cancel Link",
  "UPS_CL": "Annuler le déchargement",
  "UPS_DL": "Charge du pilote",
  "UPS_DP": "Lecture au départ",
  "UPS_DS": "Lecture à destination",
  "UPS_EP": "Lecture à l'export",
  "UPS_HU": "Lecture à Hub",
  "UPS_IP": "Lecture à l'import",
  "UPS_IT": "En transit",
  "UPS_LC": "Lecture au location",
  "UPS_LD": "Charger",
  "UPS_LK": "Link ULO To ULO",
  "UPS_OF": "En cours de livraison",
  "UPS_OR": "Lecture de l'origine",
  "UPS_PU": "Lecture de l'enlèvement",
  "UPS_RK": "Remove ULO from ULO",
  "UPS_TR": "Transfer ULO to ULO",
  "UPS_UA": "Mise à jour arrivée",
  "UPS_UD": "Mis à jour départ",
  "UPS_UF": "ULO Load Key from",
  "UPS_UL": "Lecture à le déchargement",
  "UPS_UT": "ULO Load Key to",
  "UPS_VF": "ULO Diversion from",
  "UPS_VT": "ULO Diversion to",
  "UPS_WH": "Lecture à l'entrepôt",
  "UPS_XA": "Au bureau de poste local",
  "UPS_XR": "Reçu par le bureau de poste local",
  "UPS_YH": "Reçu par le bureau de poste local",
  "UPS_UI": "Enlèvement de l'agent; en transit vers l'ASI.",
  "UPS_VP": "Annulation de l'enlèvement",
  "UPS_TL": "Lecture à transit",
  "UPS_SD": "Tentative de livraison",
  "UPS_LM": "Lecture au localisation",
  "UPS_OC": "Lecture de l'origine",
  "UPS_OT": "En cours de livraison aujourd'hui",
  "UPS_AG": "Le colis est en transit vers une installation UPS",
  "EXPCFM": "Colis est en cours d'acheminement",
  "AARCFM": "Arrivée en HUB de distribution CDG",
  "SOLREC": "Retour au dépôt colicoli - Tentatives de livraison infructueuses",
  "SOLMLV": "Retour au dépôt colicoli - Remis en livraison",
  "SOLRED": "Retour au dépôt colicoli - Retour à l'expediteur",
  "DCHRCA": "Votre colis est retourné à l'expéditeur suite à un endommagement. Nous vous prions d'accepter nos excuses.",
  "RSTPRO": "Le contenu de votre colis est prohibé, il ne pourra pas être livré à son destinataire.",
  "CHGCFM": "Votre colis est arrivé en France",
  "RENDDC": "Colis détruit sur demande du client",
  "AARDVY": "Votre colis est arrivé par erreur sur un site, il est en cours de réacheminement vers son site de distribution.",
  "RENEFM": "Non livré - Force majeure",
  "RCDDVY": "En raison d'un problème d'adresse, votre colis a été réacheminé vers le site de distribution qui dessert votre adresse.",
  "LIVRTI": "Votre colis a été remis au gardien ou à un des voisins",
  "LIVSCO": "Livré - Expédition livrée en société",
  "LIVBPV": "Livré - Expédition livrée e boite à lettre volumineuse",
  "ATTCFM": "Arrivée en agence de livraison",
  "RENJRC": "Non livré - Colis Jamais Reçu",
  "RENDAF": "Non livré - Magasin Fermé à la livraison",
  "DCHRMA": "L'emballage de votre colis va être renforcé pour assurer sa livraison",
  "DCHDDT": "Votre colis a quitté le bureau d'échange, il est en cours d'acheminement dans le pays de destination.",
  "RENNJU": "Non livré - Livraison à planifier",
  "AARHUB": "Votre colis est arrivé sur son site de distribution.",
  "RENPRE": "Non livré - Remis au poin trelais après deux tentaives de livraison",
  "EXPQLT": "Votre colis a quitté le territoire",
  "INVPOI": "Non livré Retour dépôt",
  "DOUEXP": "Votre colis est dédouané et il poursuit son acheminement.",
  "RSTBRT": "Votre colis récupéré par notre agence n'est pas conforme. Il va être retourné à l'expéditeur.",
  "ENEDOC": "Votre colis n'a pas pu être récupéré car le numéro indiqué sur l'étiquette ne correspondait pas à celui du colis à récupérer. Vous disposez de 7 jours à compter de la date d'achat pour le déposer en bureau de poste.",
  "PCHTAR": "Votre colis a été déposé dans un point postal trop tardivement pour partir aujourd'hui. Il partira demain (ou le prochain jour ouvré en cas de dimanche ou jour férié).",
  "ENEMQT": "Votre colis n'a pas pu être récupéré car il n'était pas présent dans la boite aux lettres. Vous disposez de 7 jours à compter de la date d'achat pour le déposer en bureau de Poste.",
  "RENTEL": "Non livré - Absence de numéro de télephone - Merci de contacter le service client 01 86 61 73 92",
  "RSTNRV": "Le colis doit être remis en mains propres au destinataire. Rendez-vous sur www.colissimo.fr/monchoix pour donner vos instructions.",
  "CITDOC": "Après traitement par nos services, votre colis est acheminé vers le destinataire. Nous vous prions d’accepter nos excuses.",
  "PCHCHM": "Votre colis est en cours d'acheminement dans son pays d'origine.",
  "SOUOUV": "Colis en souffrance - Merci de contacter le service client 01 86 61 73 92",
  "ECHMQT": "Votre colis récupéré par notre agence n'est pas conforme. Il va être retourné à l'expéditeur.",
  "RENVIG": "Non livré - Digicode manquant",
  "ENEDAF": "Votre colis n'a pas pu être récupéré car la boite aux lettres était introuvable ou non accessible. Vous disposez de 7 jours à compter de la date d'achat pour le déposer en bureau de Poste.",
  "RENSPO": "Non livré - Colis Perdu - Merci de contacter le service client 01 86 61 73 92",
  "RENAVA": "Non livré - Colis Endommagé - Merci de contacter le service client 01 86 61 73 92",
  "RENAUT": "Non livré - Autre",
  "ENENCF": "Votre colis n'a pas pu être récupéré car il ne comportait pas d'étiquette d'affranchissement. Vous disposez de 7 jours à compter de la date d'achat pour le déposer en bureau de poste.",
  "RENNRV": "Non livré - En livraison - Demande client a être livré un autre jour",
  "RSTFMA": "La livraison de votre colis a été reportée pour accès impossible.",
  "RENRLI": "Le destinataire était absent lors de la livraison. Votre colis sera présenté à nouveau le prochain jour ouvré",
  "RSTNCG": "Votre colis n'a pas pu être livré sur rendez-vous. Le destinataire sera prochainement recontacté.",
  "RENVVE": "Non livré - Colis ne passant pas en boite au lettre",
  "RENHZD": "Non livré - Hors Zone de Distribution - Merci de contacter le service client 01 86 61 73 92",
  "RENABS": "Non livré - Absence du destinataire",
  "LIVPER": "Livré - Expédition livrée en personne",
  "RENPCO": "Non livré - Digicode Manquant",
  "MLVARS": "Votre colis est disponible dans votre bureau de poste. Le destinataire dispose de 15 jours consécutifs pour retirer son colis sur présentation d'une pièce d'identité et de l'avis d'instance.",
  "MLVPLI": "Votre colis est prêt à être livré",
  "RENTAR": "En raison de votre refus pour cause de retard, votre colis est retourné à l'expéditeur.",
  "LIVCFM": "Votre colis est livré.",
  "LIVGAR": "Livré - Expédition livrée au gardien",
  "LIVBPO": "Livré - Expédition livrée en boite au lettre",
  "RENPAM": "Non livré - Véhicule en panne",
  "SOLREO": "Le colis n'a pu être livré au destinataire malgré nos recherches. Le colis est retourné à l'Expéditeur. ",
  "RENPER": "Non livré - Colis Perdu - Merci de contacter le service client 01 86 61 73 92",
  "RENREF": "Non livré - Livraison refusé - Merci de contacter le service client 01 86 61 73 92",
  "CHGRCA": "L'emballage de votre colis a été renforcé pour assurer sa livraison.",
  "SOUCLO": "souffrance cloturée - Acheminement en cours",
  "RENRTI": "Le colis n'a pu être remis à son Destinataire lors de notre passage et il en a été informé. Le colis sera adressé au Bureau de Poste du Destinataire.",
  "RSTDIL": "Le destinataire a choisi la date de livraison de son colis.",
  "RENDID": "Votre colis n'a pas été retiré au bureau de poste dans les délais d'instance de 15 jours consécutifs, il est retourné à l'expéditeur",
  "RENINJ": "Non livré - Destinataire injoignable",
  "RENAVI": "Non livré - Absence suite à une seconde présentation - Merci de contacter le service client 01 86 61 73 92",
  "RENCAD": "Non livré - Mauvaise adresse - Merci de contacter le service client 01 86 61 73 92",
  "RENLNA": "Le colis est réexpédié à la demande du destinataire, vers l'adresse de son choix.",
  "SOLREI": "Retour au dépôt colicoli - Retour à l'expediteur",
  "MLVARX": "Votre colis est disponible dans un point de retrait différent de celui choisi initialement. Le destinataire en a été informé par email. Le colis est à retirer pendant 10 jours ouvrables sur présentation d'une pièce d'identité et du bon de retrait.",
  "ENEAVA": "Vous avez choisi le service d'envoi en boite aux lettres pour votre colis. Nous n'avons malheureusement pas pu réaliser la prestation car votre colis était endommagé ou ouvert. Une notification vous a été adressée et vous indique la marche à suivre.",
  "DOUIIR": "Votre colis est retenu par nos services pour un problème de déclaration douanière. Le destinataire du colis va être contacté.",
  "LIVREO": "Le colis est livré à l'expéditeur suite à un retour",
  "COMCFM": "Votre colis est prêt à être expédié, il va être remis à La Poste.",
  "DOUDOU": "Votre colis est retenu par nos services dans l'attente de son dédouanement.",
  "DCHCFM": "Votre colis est arrivé dans le pays du destinataire.",
  "RENCAT": "Le colis ne peut actuellement être livré au Destinataire : L'adresse de livraison est incomplète, nous recherchons la partie non renseignée pour le livrer. Le destinataire peut contacter notre service client pour apporter les compléments nécessaires.",
  "RENSRB": "Votre colis est retourné à l'expéditeur, le contre-remboursement n'a pas été accepté.",
  "RENGEO": "Non livré - Mauvaise adresse - Merci de contacter le service client 01 86 61 73 92",
  "PCHCFM": "Votre colis est pris en charge. Il est en cours d'acheminement dans le pays de destination.",
  "DCHDDC": "Votre colis est en cours de dédouanement.",
  "PAQCOM": "Livré au point relais",
  "RENDIV": "Le colis a été refusé par le Destinataire. Le colis est retourné à l'Expéditeur.",
  "RSTFHB": "La livraison de votre colis a été reportée pour fermeture ou accès impossible.",
  "RENDEM": "Non livré - Client a déménagé - Merci de contacter le service client 01 86 61 73 92",
  "DOUIDD": "Votre colis est retenu par nos services pour un problème de déclaration douanière. Le destinataire du colis va être contacté.",
  "MLVCFM": "En cours de livraison",
  "RENTER": "Non livré - Hors zone de distribution conducteur",
  "RENDIA": "Le colis n'a pu être livré au destinataire malgré nos recherches. Le colis est retourné à l'Expéditeur.",
  "PAQPAR": "Livré au point relais",
  "RENOUV": "Non livré - Colis Ouvert - Merci de contacter le service client 01 86 61 73 92",
  "RENARV": "Le destinataire était absent lors de la livraison de son colis sur rendez-vous. Il sera prochainement recontacté.",
  "DOUDDM": "Votre colis est retenu par nos services pour un problème de déclaration douanière. Le destinataire du colis va être contacté.",
  "DOUFCM": "Votre colis est retenu par nos services pour un problème de facture. Le destinataire du colis va être contacté.",
  "DOUTAX": "Votre colis est en cours d'acheminement et sera livré contre paiement d'une taxe douanière.",
  "DOUAGV": "Votre colis est en cours de dédouanement.",
  "RENFCO": "Votre colis n'a pas pu être livré ce jour dans votre point de retrait. Nous allons l'acheminer vers un nouveau point. Vous recevrez une notification dès que votre colis sera disponible.",
  "DOURES": "Votre colis est retenu par les services postaux car une licence d''importation est requise. Le destinataire du colis va être contacté.",
  "SOLSAV": "Votre colis a subi un incident, l'expéditeur doit se rendre à son bureau de poste avec la preuve de dépôt ou prendre contact avec notre service client via le formulaire de notre site Internet.",
  "RENREN": "Le colis est retourné à l'expéditeur suite à un refus du destinataire.",
  "LIVVOI": "Livré - Expédition livrée au voisin",
  "RENAIN": "Votre colis ne peut actuellement être livré au destinataire, l'adresse de livraison étant incomplète. Le destinataire peut contacter notre service clients pour apporter les compléments nécessaires, en cliquant sur Nous contacter en ligne.",
  "RENECH": "Non livré - Le casier libre-service est en panne.",
  "LIVLOC": "Votre colis a été livré en casier libre-service.",
  "CHNSDCL": "Online dans Colissimo - No. colis",
  "RENINA": "Non livré - Locker inacessible",
  "RETURN_SCAN_ESENDEO": "Colis a été retourné au dépôt d’Esendeo."
}
